[
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Maria Noyen",
    "title": "Why Uniqlo is thriving right now",
    "description": "Fast Retailing's record earnings highlight Uniqlo's success with functional basics, setting trends while leveraging Japanese brand trust abroad.",
    "url": "https://www.businessinsider.com/why-uniqlo-is-winning-affordable-basics-doesnt-chase-trends-2024-10",
    "urlToImage": "https://i.insider.com/670e91db6ac7b701e7cb426b?width=1200&format=jpeg",
    "publishedAt": "2024-10-18T09:40:51Z",
    "content": "A pedestrian walks past the Japanese clothing brand store Uniqlo store in Hong Kong.Budrul Chukrut/SOPA Images/LightRocket via Getty Images\r\n<ul><li>Uniqlo's parent recently reported record earnings … [+6137 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Why Uniqlo is thriving right now Fast Retailings record earnings highlight Uniqlos success with functional basics, setting trends while leveraging Japanese brand trust abroad. A pedestrian walks past the Japanese clothing brand store Uniqlo store in Hong Kong.Budrul ChukrutSOPA ImagesLightRocket via Getty Images Uniqlos parent recently reported record earnings"
  },
  {
    "source": {
      "id": null,
      "name": "Theregister.com"
    },
    "author": "Connor Jones",
    "title": "Alleged Bitcoin crook faces 5 years after SEC's X account pwned",
    "description": "SIM swappers strike again, warping cryptocurrency prices\nAn Alabama man faces five years in prison for allegedly attempting to manipulate the price of Bitcoin by pwning the US Securities and Exchange Commission's X account earlier this year.…",
    "url": "https://www.theregister.com/2024/10/18/sec_bitcoin_arrest/",
    "urlToImage": "https://regmedia.co.uk/2024/03/04/bitcoin_shutterstock.jpg",
    "publishedAt": "2024-10-18T12:30:09Z",
    "content": "An Alabama man faces five years in prison for allegedly attempting to manipulate the price of Bitcoin by pwning the US Securities and Exchange Commission's X account earlier this year.\r\nThe feds arre… [+3651 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Alleged Bitcoin crook faces 5 years after SECs X account pwned SIM swappers strike again, warping cryptocurrency prices An Alabama man faces five years in prison for allegedly attempting to manipulate the price of Bitcoin by pwning the US Securities and Exchange Commissions X account earlier this year. An Alabama man faces five years in prison for allegedly attempting to manipulate the price of Bitcoin by pwning the US Securities and Exchange Commissions X account earlier this year. The feds arre"
  },
  {
    "source": {
      "id": null,
      "name": "GameSpot"
    },
    "author": "Darryn Bonthuys",
    "title": "Where Is Xur Today? (October 18-22) Destiny 2 Exotic Items And Xur Location Guide",
    "description": "Xur has opened up shop once again in Destiny 2 ,and this week, he's selling Xurfboards. In addition to his usual selection of Exotic arms and armor, you'll be able to get yourself a skimmer to jet around on, provided that you have a hefty 97 Strange Coins to …",
    "url": "https://www.gamespot.com/articles/where-is-xur-today-october-18-22-destiny-2-exotic-items-and-xur-location-guide/1100-6527257/",
    "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/4386763-xur.jpg",
    "publishedAt": "2024-10-18T17:04:00Z",
    "content": "Xur has opened up shop once again in Destiny 2 ,and this week, he's selling Xurfboards. In addition to his usual selection of Exotic arms and armor, you'll be able to get yourself a skimmer to jet ar… [+2876 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Where Is Xur Today? October 18-22 Destiny 2 Exotic Items And Xur Location Guide Xur has opened up shop once again in Destiny 2 ,and this week, hes selling Xurfboards. In addition to his usual selection of Exotic arms and armor, youll be able to get yourself a skimmer to jet around on, provided that you have a hefty 97 Strange Coins to Xur has opened up shop once again in Destiny 2 ,and this week, hes selling Xurfboards. In addition to his usual selection of Exotic arms and armor, youll be able to get yourself a skimmer to jet ar"
  },
  {
    "source": {
      "id": null,
      "name": "PC Gamer"
    },
    "author": "Mollie Taylor",
    "title": "'We apologize for not meeting the community's expectations:' Tekken 8 makes a rare acknowledgement of fan backlash after failing to include a $5 stage in its season pass",
    "description": "It's giving people free currency and pass holders the next stage as an apology.",
    "url": "https://www.pcgamer.com/games/fighting/we-apologize-for-not-meeting-the-communitys-expectations-tekken-8-makes-a-rare-acknowledgement-of-fan-backlash-after-failing-to-include-a-usd5-stage-in-its-season-pass/",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/FikVoAE9Sx6vwsCrUgr94k-1200-80.jpg",
    "publishedAt": "2024-10-18T11:16:09Z",
    "content": "Tekken 8's monetisation model has been landing Bandai Namco in hot water for a good chunk of this year. Sneaky cash shop introductions first drew fan ire back in February, with the more recent critic… [+2277 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "We apologize for not meeting the communitys expectations Tekken 8 makes a rare acknowledgement of fan backlash after failing to include a 5 stage in its season pass Its giving people free currency and pass holders the next stage as an apology. Tekken 8s monetisation model has been landing Bandai Namco in hot water for a good chunk of this year. Sneaky cash shop introductions first drew fan ire back in February, with the more recent critic"
  },
  {
    "source": {
      "id": null,
      "name": "The New Yorker"
    },
    "author": "Susan B. Glasser",
    "title": "How Republican Billionaires Learned to Love Trump Again",
    "description": "The former President has successfully won over wealthy figures including Elon Musk, Nelson Peltz, Steve Wynn, Miriam Adelson, José (Pepe) Fanjul, Stephen Schwarzman, Timothy Mellon, and David Sacks. Susan Glasser reports.",
    "url": "https://www.newyorker.com/magazine/2024/10/28/how-republican-billionaires-learned-to-love-trump-again",
    "urlToImage": "https://media.newyorker.com/photos/670edd65cc86526c297a48b0/16:9/w_1280,c_limit/r45135.jpg",
    "publishedAt": "2024-10-18T10:00:00Z",
    "content": "The reason is structural: Democrats have retained an advantage in small online donations, while Republicans rely on a higher percentage of large contributions. As of late September, sixty-eight per c… [+11787 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "How Republican Billionaires Learned to Love Trump Again The former President has successfully won over wealthy figures including Elon Musk, Nelson Peltz, Steve Wynn, Miriam Adelson, José Pepe Fanjul, Stephen Schwarzman, Timothy Mellon, and David Sacks. Susan Glasser reports. The reason is structural Democrats have retained an advantage in small online donations, while Republicans rely on a higher percentage of large contributions. As of late September, sixty-eight per c"
  },
  {
    "source": {
      "id": null,
      "name": "Hackaday"
    },
    "author": "Jenny List",
    "title": "A Hacker’s Travel Guide To Europe",
    "description": "This summer, I was pleasantly surprised when a friend of mine from Chicago turned up at one of the hacker camps I attended. A few days of hanging out in the sun ensued, doing cool hacker camp stuff…",
    "url": "https://hackaday.com/2024/10/18/a-hackers-travel-guide-to-europe/",
    "urlToImage": "https://hackaday.com/wp-content/uploads/2024/09/europe-guide-featured.jpg",
    "publishedAt": "2024-10-18T17:00:47Z",
    "content": "This summer, I was pleasantly surprised when a friend of mine from Chicago turned up at one of the hacker camps I attended. A few days of hanging out in the sun ensued, doing cool hacker camp stuff, … [+7837 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "A Hackers Travel Guide To Europe This summer, I was pleasantly surprised when a friend of mine from Chicago turned up at one of the hacker camps I attended. A few days of hanging out in the sun ensued, doing cool hacker camp stuff This summer, I was pleasantly surprised when a friend of mine from Chicago turned up at one of the hacker camps I attended. A few days of hanging out in the sun ensued, doing cool hacker camp stuff,"
  },
  {
    "source": {
      "id": null,
      "name": "Europa.eu"
    },
    "author": "European Central Bank",
    "title": "Results of the September 2024 Survey on credit terms and conditions in euro-denominated securities financing and over-the-counter derivatives markets (SESFOD)",
    "description": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "url": "https://www.ecb.europa.eu/press/pr/date/2024/html/ecb.pr241018~06adb02edb.en.html",
    "urlToImage": "https://www.ecb.europa.eu/press/shared/img/socialmedia/social-default.jpg?0ef1632c35edede913681bb76af694a4",
    "publishedAt": "2024-10-18T07:00:00Z",
    "content": "18 October 2024\r\n<ul><li>Overall credit terms and conditions eased somewhat between June 2024 and August 2024 on account of improved general market liquidity</li><li>Increase in demand for funding se… [+4273 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Results of the September 2024 Survey on credit terms and conditions in euro-denominated securities financing and over-the-counter derivatives markets SESFOD The European Central Bank ECB is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency. 18 October 2024 Overall credit terms and conditions eased somewhat between June 2024 and August 2024 on account of improved general market liquidityIncrease in demand for funding se"
  },
  {
    "source": {
      "id": null,
      "name": "The Points Guy"
    },
    "author": "Sean Cudahy",
    "title": "Alaska Airlines mulls Honolulu lounge, iffy on credit card transfers for new joint loyalty program with Hawaiian Airlines",
    "description": "This week, Alaska Airlines announced sweeping changes to its Alaska Airlines Mileage Plan program. The overhaul will make it easier for customers to earn elite status and loyalty perks in 2025. Plus, the carrier revealed that customers should soon be able to …",
    "url": "https://thepointsguy.com/news/alaska-hawaiian-joint-loyalty-program-plans/",
    "urlToImage": "https://thepointsguy.global.ssl.fastly.net/us/originals/2023/08/Alaska-Airlines-Boeing-737-MAX-9-scaled.jpg",
    "publishedAt": "2024-10-18T13:05:33Z",
    "content": "This week, Alaska Airlines announced sweeping changes to its Alaska Airlines Mileage Plan program. The overhaul will make it easier for customers to earn elite status and loyalty perks in 2025. Plus,… [+8518 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Alaska Airlines mulls Honolulu lounge, iffy on credit card transfers for new joint loyalty program with Hawaiian Airlines This week, Alaska Airlines announced sweeping changes to its Alaska Airlines Mileage Plan program. The overhaul will make it easier for customers to earn elite status and loyalty perks in 2025. Plus, the carrier revealed that customers should soon be able to This week, Alaska Airlines announced sweeping changes to its Alaska Airlines Mileage Plan program. The overhaul will make it easier for customers to earn elite status and loyalty perks in 2025. Plus,"
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "asia.nikkei.com",
    "title": "Japan's top currency diplomat says recent yen moves are 'one-sided'",
    "description": "Japan's top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are \"somewhat one-sided and rapid,\" in a fresh warning against speculative trading as the yen fell past the key 150 line against the dollar.\n\"We as Japanese authorities a…",
    "url": "https://biztoc.com/x/facfcf8117d60341",
    "urlToImage": "https://biztoc.com/cdn/facfcf8117d60341_s.webp",
    "publishedAt": "2024-10-18T04:33:42Z",
    "content": "Japan's top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are \"somewhat one-sided and rapid,\" in a fresh warning against speculative trading as the yen fell past the ke… [+154 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Japans top currency diplomat says recent yen moves are one-sided Japans top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are somewhat one-sided and rapid, in a fresh warning against speculative trading as the yen fell past the key 150 line against the dollar. We as Japanese authorities a Japans top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are somewhat one-sided and rapid, in a fresh warning against speculative trading as the yen fell past the ke"
  },
  {
    "source": {
      "id": null,
      "name": "Mckinsey.com"
    },
    "author": null,
    "title": "Global payments in 2024: Simpler interfaces, complex reality",
    "description": "Global payments are becoming simpler for users, but complexity keeps growing behind the scenes. This year’s report explores this paradox and the options for providers.",
    "url": "https://www.mckinsey.com/industries/financial-services/our-insights/global-payments-in-2024-simpler-interfaces-complex-reality",
    "urlToImage": "https://www.mckinsey.com/~/media/mckinsey/industries/financial%20services/our%20insights/global%20payments%20in%202024%20simpler%20interfaces%20complex%20reality/thumb-gettyimages-1353813198.jpg",
    "publishedAt": "2024-10-18T00:00:00Z",
    "content": "The tantalizing vision for global payments has long been that theyd be safe, simple, quick, inexpensive, and ubiquitous. This promise has come closer with each new technological advance. However, ins… [+14475 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Global payments in 2024 Simpler interfaces, complex reality Global payments are becoming simpler for users, but complexity keeps growing behind the scenes. This years report explores this paradox and the options for providers. The tantalizing vision for global payments has long been that theyd be safe, simple, quick, inexpensive, and ubiquitous. This promise has come closer with each new technological advance. However, ins"
  },
  {
    "source": {
      "id": null,
      "name": "The Punch"
    },
    "author": "Tunde Odesola",
    "title": "Pasuma, Currency and Super Eagles’ humiliation (1)",
    "description": "Indeed and in deed, I’m not envious of the T-Pain nickname of President Bola Tinubu because I’m T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President is forcing down the throats of Nigerians. My T-P, Tunde-Par…",
    "url": "https://punchng.com/pasuma-currency-and-super-eagles-humiliation-1/",
    "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2023/02/17072659/Tunde-Odesola-.jpg",
    "publishedAt": "2024-10-18T00:36:16Z",
    "content": "Indeed and in deed, Im not envious of the T-Pain nickname of President Bola Tinubu because Im T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President i… [+7611 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Pasuma, Currency and Super Eagles humiliation 1 Indeed and in deed, Im not envious of the T-Pain nickname of President Bola Tinubu because Im T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President is forcing down the throats of Nigerians. My T-P, Tunde-Par Indeed and in deed, Im not envious of the T-Pain nickname of President Bola Tinubu because Im T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President i"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ET Online",
    "title": "India's forex reserves fall by $10.7 billion",
    "description": "India's forex reserves contracted by $10.7 billion to $690 billion as of October 11, with foreign currency assets reducing by $10.5 billion to $602 billion. Gold reserves and SDRs also saw a dip, while the RBI continues managing market volatility to prevent s…",
    "url": "https://economictimes.indiatimes.com/news/economy/indicators/indias-forex-reserves-fall-by-10-7-billion/articleshow/114339941.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114339970,width-1200,height-630,imgsize-93140,overlay-economictimes/articleshow.jpg",
    "publishedAt": "2024-10-18T11:40:23Z",
    "content": "Artificial Intelligence(AI)\r\nAI and Analytics based Business Strategy\r\nBy - Tanusree De, Managing Director- Accenture Technology Lead, Trustworthy AI Center of Excellence: ATCI\r\nView Program",
    "categories": [
      "Currency Specific",
      "Market Sentiment"
    ],
    "full_description": "Indias forex reserves fall by 10.7 billion Indias forex reserves contracted by 10.7 billion to 690 billion as of October 11, with foreign currency assets reducing by 10.5 billion to 602 billion. Gold reserves and SDRs also saw a dip, while the RBI continues managing market volatility to prevent s Artificial IntelligenceAI AI and Analytics based Business Strategy By - Tanusree De, Managing Director- Accenture Technology Lead, Trustworthy AI Center of Excellence ATCI View Program"
  },
  {
    "source": {
      "id": null,
      "name": "Europa.eu"
    },
    "author": "European Central Bank",
    "title": "Decisions taken by the Governing Council of the ECB (in addition to decisions setting interest rates)",
    "description": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "url": "https://www.ecb.europa.eu//press/govcdec/otherdec/2024/html/ecb.gc241018~ebe88e2143.en.html",
    "urlToImage": "https://www.ecb.europa.eu/press/govcdec/shared/img/socialmedia/social-default.jpg?1b07e3d68efd7f29f4771d75b50bd667",
    "publishedAt": "2024-10-18T13:00:00Z",
    "content": "October 2024\r\n18 October 2024\r\nMarket operations\r\nRegular review of the agreement on emergency liquidity assistance (ELA)\r\nOn 27 September 2024 the Governing Council adopted a revised version of the … [+4153 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Decisions taken by the Governing Council of the ECB in addition to decisions setting interest rates The European Central Bank ECB is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency. October 2024 18 October 2024 Market operations Regular review of the agreement on emergency liquidity assistance ELA On 27 September 2024 the Governing Council adopted a revised version of the"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Associated Press Finance",
    "title": "Egypt increases fuel prices by 10% to 17%",
    "description": "Egypt raised fuel prices Friday by between 10% and 17%, a move likely to impact the cost of both goods and services.  The Egyptian government said in a...",
    "url": "https://finance.yahoo.com/news/egypt-increases-fuel-prices-10-103452088.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/X5KGc16OZn_51uZfOto93Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap_finance_articles_694/f43280dfdd41adf26a4d636840796760",
    "publishedAt": "2024-10-18T10:34:52Z",
    "content": "CAIRO (AP) Egypt raised fuel prices Friday by between 10% and 17%, a move likely to impact the cost of both goods and services.\r\nThe Egyptian government said in a statement on Facebook that the decis… [+1249 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Egypt increases fuel prices by 10 to 17 Egypt raised fuel prices Friday by between 10 and 17, a move likely to impact the cost of both goods and services. The Egyptian government said in a... CAIRO AP Egypt raised fuel prices Friday by between 10 and 17, a move likely to impact the cost of both goods and services. The Egyptian government said in a statement on Facebook that the decis"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Japan top FX diplomat says recent yen moves \"one-sided\" in fresh warning",
    "description": "Japan top FX diplomat says recent yen moves \"one-sided\" in fresh warning",
    "url": "https://www.investing.com/news/economy-news/japan-top-fx-diplomat-says-recent-yen-moves-onesided-in-fresh-warning-3670039",
    "urlToImage": "https://i-invdn-com.investing.com/news/indicatornews_3_800x533_L_1412601605.jpg",
    "publishedAt": "2024-10-18T00:41:11Z",
    "content": "By Makiko Yamazaki\r\nTOKYO (Reuters) - Japan's top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are \"somewhat one-sided and rapid,\" in a fresh warning against speculati… [+487 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Japan top FX diplomat says recent yen moves one-sided in fresh warning By Makiko Yamazaki TOKYO Reuters - Japans top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are somewhat one-sided and rapid, in a fresh warning against speculati"
  },
  {
    "source": {
      "id": null,
      "name": "Siliconera"
    },
    "author": "Stephanie Liu",
    "title": "Persona 5 Royal Kasumi Is a Free Skin in Identity V",
    "description": "The final character in the Persona 5 Royal collaboration in Identity V will be Kasumi Yoshizawa, or Violet. You’ll be able to claim her for free by participating in the crossover event.\n\n\nIn order to get her, you’ll need to collect seals. This will likely be …",
    "url": "https://www.siliconera.com/persona-5-royal-kasumi-is-a-free-skin-in-identity-v/",
    "urlToImage": "https://www.siliconera.com/wp-content/uploads/2024/10/kasumi-idv-10182024.jpg",
    "publishedAt": "2024-10-18T13:30:21Z",
    "content": "The final character in the Persona 5 Royal collaboration in Identity V will be Kasumi Yoshizawa, or Violet. Youll be able to claim her for free by participating in the crossover event.\r\nIn order to g… [+1220 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Persona 5 Royal Kasumi Is a Free Skin in Identity V The final character in the Persona 5 Royal collaboration in Identity V will be Kasumi Yoshizawa, or Violet. Youll be able to claim her for free by participating in the crossover event. In order to get her, youll need to collect seals. This will likely be The final character in the Persona 5 Royal collaboration in Identity V will be Kasumi Yoshizawa, or Violet. Youll be able to claim her for free by participating in the crossover event. In order to g"
  },
  {
    "source": {
      "id": null,
      "name": "Europa.eu"
    },
    "author": "European Central Bank",
    "title": "Results of the ECB Survey of Professional Forecasters for the fourth quarter of 2024",
    "description": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "url": "https://www.ecb.europa.eu//press/pr/date/2024/html/ecb.pr241018_1~9b5ce6a9bf.en.html",
    "urlToImage": "https://www.ecb.europa.eu/press/shared/img/socialmedia/social-default.jpg?0ef1632c35edede913681bb76af694a4",
    "publishedAt": "2024-10-18T08:00:00Z",
    "content": "18 October 2024\r\n<ul><li>Inflation expectations at 2.4% for 2024 and 1.9% for 2025 and 2026; unchanged except for 0.1 percentage point downward revision for 2025; longer-term inflation expectations (… [+1674 chars]",
    "categories": [
      "Monetary Policy",
      "Economic Indicators",
      "Currency Specific",
      "Market Sentiment",
      "Geopolitical"
    ],
    "full_description": "Results of the ECB Survey of Professional Forecasters for the fourth quarter of 2024 The European Central Bank ECB is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency. 18 October 2024 Inflation expectations at 2.4 for 2024 and 1.9 for 2025 and 2026 unchanged except for 0.1 percentage point downward revision for 2025 longer-term inflation expectations"
  },
  {
    "source": {
      "id": null,
      "name": "[Removed]"
    },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-18T08:38:45Z",
    "content": "[Removed]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Removed"
  },
  {
    "source": {
      "id": null,
      "name": "Skift"
    },
    "author": "Skift",
    "title": "Why Collaboration Is Essential For Independent Hotel Brands",
    "description": "Chris Hartley and Kristi Gole of Global Hotel Alliance took the stage at Skift Global Forum to discuss how collaborating with other independent hotels increases small brands’ access to customers, technology solutions, and loyalty benefits, all without sacrifi…",
    "url": "http://skift.com/2024/10/18/why-collaboration-is-essential-for-independent-hotel-brands/",
    "urlToImage": "https://skift.com/wp-content/uploads/2024/10/0P5A5119-scaled.jpg",
    "publishedAt": "2024-10-18T13:58:49Z",
    "content": "This sponsored content was created in collaboration with a Skift partner.\r\nWhen Global Hotel Alliance was founded in 2004, the travel industry looked vastly different than it does today. Back then, m… [+6673 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Why Collaboration Is Essential For Independent Hotel Brands Chris Hartley and Kristi Gole of Global Hotel Alliance took the stage at Skift Global Forum to discuss how collaborating with other independent hotels increases small brands access to customers, technology solutions, and loyalty benefits, all without sacrifi This sponsored content was created in collaboration with a Skift partner. When Global Hotel Alliance was founded in 2004, the travel industry looked vastly different than it does today. Back then, m"
  },
  {
    "source": {
      "id": null,
      "name": "Live Science"
    },
    "author": "emily.cooke@futurenet.com (Emily Cooke)",
    "title": "Potential health hazards of cryptocurrency mines laid bare by scientists",
    "description": "Anecdotal reports suggest that cryptocurrency mines can have harmful knock-on effects on people's health, but the true scale of the problem is still unknown.",
    "url": "https://www.livescience.com/health/potential-health-hazards-of-cryptocurrency-mines-laid-bare-by-scientists",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/sozCCXu33igVZ67sK5Wr2K-1200-80.jpg",
    "publishedAt": "2024-10-18T13:11:36Z",
    "content": "In summer 2024, several news outlets chronicled the \"nightmarish\r\n\" impacts Texas communities endured due to the din of noise emanating from nearby cryptocurrency mines\r\n.\r\nResidents of these communi… [+6797 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Potential health hazards of cryptocurrency mines laid bare by scientists Anecdotal reports suggest that cryptocurrency mines can have harmful knock-on effects on peoples health, but the true scale of the problem is still unknown. In summer 2024, several news outlets chronicled the nightmarish  impacts Texas communities endured due to the din of noise emanating from nearby cryptocurrency mines . Residents of these communi"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Kevin Buckland",
    "title": "Dollar buoyant, equities cautious ahead of China data",
    "description": "The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve...",
    "url": "https://finance.yahoo.com/news/dollar-buoyant-equities-cautious-ahead-013640653.html",
    "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/84f28d4a7f2fce92bc9f00ba325ededb",
    "publishedAt": "2024-10-18T01:36:40Z",
    "content": "By Kevin Buckland\r\nTOKYO (Reuters) - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing… [+3375 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Dollar buoyant, equities cautious ahead of China data The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve... By Kevin Buckland TOKYO Reuters - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing"
  },
  {
    "source": {
      "id": null,
      "name": "Cheezburger.com"
    },
    "author": "JR Atkinson, JR Atkinson",
    "title": "38 Memes of Varied Themes",
    "description": "I'd like to amend rule 34 to say, \"If it exists, there's a meme about it.\" From my experience as a professional meme curator, I know this to be true. There is a meme for every hobby, every micro trend, every food, every TV show, every emotion you could ever t…",
    "url": "https://cheezburger.com/37359365/38-memes-of-varied-themes",
    "urlToImage": "https://i.chzbgr.com/thumb1200/37359365/hDECACEAA/twitter-memes-meme-animal-memes-funny-cat-memes-silly-silly-memes-funny-random-memes-funny-tweets",
    "publishedAt": "2024-10-18T11:00:00Z",
    "content": "I'd like to amend rule 34 to say, \"If it exists, there's a meme about it.\" From my experience as a professional meme curator, I know this to be true. There is a meme for every hobby, every micro tren… [+637 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "38 Memes of Varied Themes Id like to amend rule 34 to say, If it exists, theres a meme about it. From my experience as a professional meme curator, I know this to be true. There is a meme for every hobby, every micro trend, every food, every TV show, every emotion you could ever t Id like to amend rule 34 to say, If it exists, theres a meme about it. From my experience as a professional meme curator, I know this to be true. There is a meme for every hobby, every micro tren"
  },
  {
    "source": {
      "id": null,
      "name": "BusinessLine"
    },
    "author": "PTI",
    "title": "Rupee slips 1 paisa to 84.07 against US dollar in early trade",
    "description": "Rupee weakens against US dollar amid negative equity markets, higher crude oil prices, and outflow of foreign funds.",
    "url": "https://www.thehindubusinessline.com/markets/forex/rupee-slips-1-paisa-to-8407-against-us-dollar-in-early-trade/article68767728.ece",
    "urlToImage": "https://bl-i.thgim.com/public/todays-paper/tp-news/4skt72/article68734295.ece/alternates/LANDSCAPE_1200/Weekly-Rupee-ViGBIDEC2FD.5.jpg.jpg",
    "publishedAt": "2024-10-18T04:22:27Z",
    "content": "The rupee slipped 1 paisa to 84.07 against the US dollar in early trade on Friday, as the weakening American currency failed to support the local unit amid negative domestic equity markets and higher… [+1222 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Rupee slips 1 paisa to 84.07 against US dollar in early trade Rupee weakens against US dollar amid negative equity markets, higher crude oil prices, and outflow of foreign funds. The rupee slipped 1 paisa to 84.07 against the US dollar in early trade on Friday, as the weakening American currency failed to support the local unit amid negative domestic equity markets and higher"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Danielle Chemtob, Forbes Staff, \n Danielle Chemtob, Forbes Staff\n https://www.forbes.com/sites/daniellechemtob/",
    "title": "Forbes Daily: ‘Insane’ AI Demand Drives A Market Surge For Chip Giants",
    "description": "Friday's edition of Forbes Daily covers Elon Musk's mysterious companies, decoding animal communication with AI, Netflix's subscriber boost, Hamas leader killed and more.",
    "url": "https://www.forbes.com/sites/daniellechemtob/2024/10/18/forbes-daily-insane-ai-demand-drives-a-market-surge-for-chip-giants/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67124aa635cdebf586ee1e8d/0x0.jpg?format=jpg&crop=4318,2428,x0,y208,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-18T11:49:36Z",
    "content": "This is a published version of the Forbes Daily newsletter, you can sign-up to get Forbes Daily in your inbox here.\r\nGood morning,\r\nBaseball may be Americas favorite pastime, but its biggest audience… [+8796 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Forbes Daily Insane AI Demand Drives A Market Surge For Chip Giants Fridays edition of Forbes Daily covers Elon Musks mysterious companies, decoding animal communication with AI, Netflixs subscriber boost, Hamas leader killed and more. This is a published version of the Forbes Daily newsletter, you can sign-up to get Forbes Daily in your inbox here. Good morning, Baseball may be Americas favorite pastime, but its biggest audience"
  },
  {
    "source": {
      "id": null,
      "name": "Psychology Today"
    },
    "author": "John Nosta",
    "title": "The Empathy Singularity",
    "description": "As AGI advances in cognitive dominance, humanity’s true edge may lie in emotional intelligence, where empathy shapes our future and redefines what it means to be human.",
    "url": "https://www.psychologytoday.com/intl/blog/the-digital-self/202410/the-empathy-singularity",
    "urlToImage": "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/teaser_image/blog_entry/2024-10/pexels-philip-justin-mamelic-1397651-3162828.jpg?itok=pUV0hRk6",
    "publishedAt": "2024-10-18T02:55:59Z",
    "content": "As the possibility or perhaps inevitability of artificial general intelligence (AGI) draws closer, its natural to wonder how human cognition can compete in a world where machines may soon match, or s… [+6125 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "The Empathy Singularity As AGI advances in cognitive dominance, humanitys true edge may lie in emotional intelligence, where empathy shapes our future and redefines what it means to be human. As the possibility or perhaps inevitability of artificial general intelligence AGI draws closer, its natural to wonder how human cognition can compete in a world where machines may soon match, or s"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "AFP",
    "title": "Japan's core inflation rate slows in September",
    "description": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.Excluding both...",
    "url": "https://finance.yahoo.com/news/japans-core-inflation-rate-slows-001922025.html",
    "urlToImage": "https://media.zenfs.com/en/afp.com/02f61df4e6fa6053776277edabc64560",
    "publishedAt": "2024-10-18T00:19:22Z",
    "content": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.\r\nThe core Consumer Price Index eased from 2.8 percent in Aug… [+1775 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Japans core inflation rate slows in September Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.Excluding both... Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in Aug"
  },
  {
    "source": {
      "id": null,
      "name": "GameSpot"
    },
    "author": "S.E. Doster",
    "title": "CoD: Black Ops 6 Zombies - All Perks, Ammo Mods, Field Upgrades, Plus How To Use Augments",
    "description": "With the launch of Call of Duty: Black Ops 6 quickly approaching, Activision has revealed tons of new information about the game's Zombies mode. This includes the full list of perks, ammo mods, and field upgrades found in the game, as well as all of the upgra…",
    "url": "https://www.gamespot.com/gallery/cod-black-ops-6-zombies-all-perks-ammo-mods-field-upgrades-plus-how-to-use-augments/2900-5875/",
    "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1639/16394540/4386824-bo6-launch-comms-zombies-027.jpg",
    "publishedAt": "2024-10-18T16:29:00Z",
    "content": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "CoD Black Ops 6 Zombies - All Perks, Ammo Mods, Field Upgrades, Plus How To Use Augments With the launch of Call of Duty Black Ops 6 quickly approaching, Activision has revealed tons of new information about the games Zombies mode. This includes the full list of perks, ammo mods, and field upgrades found in the game, as well as all of the upgra GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links."
  },
  {
    "source": {
      "id": "rt",
      "name": "RT"
    },
    "author": "RT",
    "title": "BRICS group beacon of hope for Africa - South African academic",
    "description": "BRICS is seen as key to shaping Africa’s knowledge, economy, and global influence, a South African academic told RT Read Full Article at RT.com",
    "url": "https://www.rt.com/africa/605899-brics-become-hope-africa/",
    "urlToImage": "https://mf.b37mrtl.ru/files/2024.10/article/67122c5b20302775912043ca.png",
    "publishedAt": "2024-10-18T11:01:32Z",
    "content": "The BRICS alliance has become a crucial platform for Africa’s aspirations to improve the continent’s economy, improve education and gain global influence, Boitumelo Ben Senokoane, head of the Directo… [+2532 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "BRICS group beacon of hope for Africa - South African academic BRICS is seen as key to shaping Africas knowledge, economy, and global influence, a South African academic told RT Read Full Article at RT.com The BRICS alliance has become a crucial platform for Africas aspirations to improve the continents economy, improve education and gain global influence, Boitumelo Ben Senokoane, head of the Directo"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes"
    },
    "author": "Andrew Wimer, Contributor, \n Andrew Wimer, Contributor\n https://www.forbes.com/sites/instituteforjustice/people/andrewwimer/",
    "title": "Trucker May Win Back Life Savings After Court Slams Flimsy Evidence",
    "description": "To send you to prison, the government has to prove its case beyond a reasonable doubt. But to take your property, the standard of proof can be shockingly low.",
    "url": "https://www.forbes.com/sites/instituteforjustice/2024/10/18/trucker-may-win-back-life-savings-after-court-slams-flimsy-evidence/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/670ed89703705a71c572c6f4/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-18T12:13:21Z",
    "content": "The Mississippi Court of Appeals recently ruled in favor of a trucker in a civil forfeiture case.\r\ngetty\r\nAlmost every American knows that the government needs to prove its case beyond a reasonable d… [+4962 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Trucker May Win Back Life Savings After Court Slams Flimsy Evidence To send you to prison, the government has to prove its case beyond a reasonable doubt. But to take your property, the standard of proof can be shockingly low. The Mississippi Court of Appeals recently ruled in favor of a trucker in a civil forfeiture case. getty Almost every American knows that the government needs to prove its case beyond a reasonable d"
  },
  {
    "source": {
      "id": null,
      "name": "International Business Times"
    },
    "author": "Marvie Basilan",
    "title": "9-Month Old Bitcoin ETFs Pass $20B In Total Net Flows – Gold ETFs Took 5 Years",
    "description": "Spot Bitcoin ETFs passed $20 billion in total net flows Thursday after a four-day inflow streak of $1.8 billion, marking a new milestone in the journey of the nine-month old funds.",
    "url": "https://www.ibtimes.com/9-month-old-bitcoin-etfs-pass-20b-total-net-flows-gold-etfs-took-5-years-3747169",
    "urlToImage": "https://d.ibtimes.com/en/full/4507404/1.png",
    "publishedAt": "2024-10-18T06:14:34Z",
    "content": "KEY POINTS\r\n<ul><li>Eric Balchunas noted that spot $BTC ETFs achieved in a much shorter time what gold ETFs reached in 5 years</li><li>This week's rally was largely thanks to BlackRock's IBIT, which … [+2985 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "9-Month Old Bitcoin ETFs Pass 20B In Total Net Flows  Gold ETFs Took 5 Years Spot Bitcoin ETFs passed 20 billion in total net flows Thursday after a four-day inflow streak of 1.8 billion, marking a new milestone in the journey of the nine-month old funds. KEY POINTS Eric Balchunas noted that spot BTC ETFs achieved in a much shorter time what gold ETFs reached in 5 yearsThis weeks rally was largely thanks to BlackRocks IBIT, which"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "First Trust Emerging Markets Local Currency Bond ETF (NASDAQ:FEMB) Shares Sold by Concourse Financial Group Securities Inc.",
    "description": "Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF (NASDAQ:FEMB – Free Report) by 6.2% during the third quarter, according to its most recent Form 13F filing with the Securities & E…",
    "url": "https://www.etfdailynews.com/2024/10/18/first-trust-emerging-markets-local-currency-bond-etf-nasdaqfemb-shares-sold-by-concourse-financial-group-securities-inc/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/first-trust-emerging-markets-local-currency-bond-etf-logo-1200x675.jpg?v=20230405063350&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T10:24:38Z",
    "content": "Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF (NASDAQ:FEMB – Free Report) by 6.2% during the third quarter, accordin… [+2944 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "First Trust Emerging Markets Local Currency Bond ETF NASDAQFEMB Shares Sold by Concourse Financial Group Securities Inc. Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF NASDAQFEMB  Free Report by 6.2 during the third quarter, according to its most recent Form 13F filing with the Securities  E Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF NASDAQFEMB  Free Report by 6.2 during the third quarter, accordin"
  },
  {
    "source": {
      "id": "nbc-news",
      "name": "NBC News"
    },
    "author": "Patrick Smith",
    "title": "Olympic snowboarder wanted for running murderous drug trafficking operation, FBI says",
    "description": "A former Olympic snowboarder has been charged with running a drug smuggling operation that allegedly shipped huge amounts of narcotics across borders and killed four people, the FBI said Thursday.",
    "url": "https://www.nbcnews.com/news/us-news/olympic-snowboarder-wanted-running-murderous-drug-trafficking-operatio-rcna176066",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241018-ryan-wedding-mb-1118-ba4223.jpg",
    "publishedAt": "2024-10-18T10:47:12Z",
    "content": "A former Olympic snowboarder has been charged with running a drug smuggling operation that allegedly shipped huge amounts of narcotics across borders and killed four people, the FBI said Thursday.\r\nA… [+2898 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Olympic snowboarder wanted for running murderous drug trafficking operation, FBI says A former Olympic snowboarder has been charged with running a drug smuggling operation that allegedly shipped huge amounts of narcotics across borders and killed four people, the FBI said Thursday. A former Olympic snowboarder has been charged with running a drug smuggling operation that allegedly shipped huge amounts of narcotics across borders and killed four people, the FBI said Thursday. A"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "GuruFocus News",
    "title": "Decoding Snap-on Inc (SNA): A Strategic SWOT Insight",
    "description": "Insightful Analysis of Snap-on Inc's Financial Health and Strategic Position",
    "url": "https://finance.yahoo.com/news/decoding-snap-inc-sna-strategic-050649157.html",
    "urlToImage": "https://media.zenfs.com/en/us.finance.gurufocus/a1d2166b412e2dda3de8784868ff22ac",
    "publishedAt": "2024-10-18T05:06:49Z",
    "content": "<ul><li>Strengths: Robust brand reputation and innovative product offerings drive customer loyalty and market dominance.\r\n</li><li>Weaknesses: The franchisee-dependent model introduces risks related … [+6211 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Decoding Snap-on Inc SNA A Strategic SWOT Insight Insightful Analysis of Snap-on Incs Financial Health and Strategic Position Strengths Robust brand reputation and innovative product offerings drive customer loyalty and market dominance. Weaknesses The franchisee-dependent model introduces risks related"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Kevin Buckland",
    "title": "Morning Bid: Lots of China news, little clarity",
    "description": "China is very much the center of attention today, following a barrage of data and remarks from its central bank chief, financial regulator and stats bureau...",
    "url": "https://finance.yahoo.com/news/morning-bid-lots-china-news-043425118.html",
    "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/aca6d555a95e01819c7d49f9c3ee6733",
    "publishedAt": "2024-10-18T04:34:25Z",
    "content": "By Kevin Buckland\r\nA look at the day ahead in European and global markets from Kevin Buckland\r\nChina is very much the center of attention today, following a barrage of data and remarks from its centr… [+1965 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Morning Bid Lots of China news, little clarity China is very much the center of attention today, following a barrage of data and remarks from its central bank chief, financial regulator and stats bureau... By Kevin Buckland A look at the day ahead in European and global markets from Kevin Buckland China is very much the center of attention today, following a barrage of data and remarks from its centr"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Christian Encila",
    "title": "Global Adoption Of Stablecoins Leaves US In The Dust—Report",
    "description": "The US-based consumers’ adoption of stablecoins is facing a slowdown in 2024 even when there is increasing activity in Bitcoin that rose in popularity following the launch of the spot Bitcoin exchange-traded funds. Related Reading: Survey: Trump Leads Harris …",
    "url": "https://bitcoinist.com/global-adoption-of-stablecoins-leaves-us-in-the-dust-report/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2024/10/A_04abaa.png",
    "publishedAt": "2024-10-18T03:00:04Z",
    "content": "The US-based consumers’ adoption of stablecoins is facing a slowdown in 2024 even when there is increasing activity in Bitcoin that rose in popularity following the launch of the spot Bitcoin exchang… [+2707 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Global Adoption Of Stablecoins Leaves US In The DustReport The US-based consumers adoption of stablecoins is facing a slowdown in 2024 even when there is increasing activity in Bitcoin that rose in popularity following the launch of the spot Bitcoin exchange-traded funds. Related Reading Survey Trump Leads Harris The US-based consumers adoption of stablecoins is facing a slowdown in 2024 even when there is increasing activity in Bitcoin that rose in popularity following the launch of the spot Bitcoin exchang"
  },
  {
    "source": {
      "id": null,
      "name": "Eurogamer.net"
    },
    "author": "Will Judd",
    "title": "Diablo 4: Vessel of Hatred review - a spirited expansion pack in the classic Blizzard style",
    "description": "I miss expansion packs. Blizzard in particular was famous for what we'd now call \"post-launch DLC\", updating the likes of StarCraft, Warcraft and Diablo with incredible upgrades that extended beloved storylines while adding on much-needed polish and complexit…",
    "url": "https://www.eurogamer.net/diablo-4-vessel-of-hatred-review",
    "urlToImage": "https://assetsio.gnwcdn.com/diablo-4-vessel-of-hatred-review-header.png?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "publishedAt": "2024-10-18T09:35:31Z",
    "content": "A polished, bewitching upgrade that sinks its claws into you - featuring perhaps the best character class in Diablo's history. \r\nI miss expansion packs. Blizzard in particular was famous for what we'… [+9376 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Diablo 4 Vessel of Hatred review - a spirited expansion pack in the classic Blizzard style I miss expansion packs. Blizzard in particular was famous for what wed now call post-launch DLC, updating the likes of StarCraft, Warcraft and Diablo with incredible upgrades that extended beloved storylines while adding on much-needed polish and complexit A polished, bewitching upgrade that sinks its claws into you - featuring perhaps the best character class in Diablos history. I miss expansion packs. Blizzard in particular was famous for what we"
  },
  {
    "source": {
      "id": null,
      "name": "Ozbargain.com.au"
    },
    "author": "Hiphopopotamus",
    "title": "Booking.com: 10% Cashback on Eligible Accommodation Bookings + $10 Bonus Cashback on $100 Spend @ Cashrewards",
    "description": "If you're making a larger booking SB has 12% cashback, ends tonight.\n\n\n DISCOUNT\n $10 bonus when you make a Booking of $100 or more\n Expires: Oct 19, 2024, 9:59:00 AM\r\n\n\n\nSpecial terms\n\nImportant: Ensure \"In Partnership with Cashrewards\" or \"Cashrewards\" bran…",
    "url": "https://www.ozbargain.com.au/node/872179",
    "urlToImage": "https://files.ozbargain.com.au/n/79/872179x.jpg?h=6d3c598a",
    "publishedAt": "2024-10-18T05:52:45Z",
    "content": "If you're making a larger booking SB has 12% cashback, ends tonight.\r\nDISCOUNT$10 bonus when you make a Booking of $100 or moreExpires: Oct 19, 2024, 9:59:00 AM\r\nSpecial terms\r\nImportant: Ensure \"In … [+1704 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Booking.com 10 Cashback on Eligible Accommodation Bookings  10 Bonus Cashback on 100 Spend  Cashrewards If youre making a larger booking SB has 12 cashback, ends tonight. DISCOUNT 10 bonus when you make a Booking of 100 or more Expires Oct 19, 2024, 95900 AM Special terms Important Ensure In Partnership with Cashrewards or Cashrewards bran If youre making a larger booking SB has 12 cashback, ends tonight. DISCOUNT10 bonus when you make a Booking of 100 or moreExpires Oct 19, 2024, 95900 AM Special terms Important Ensure In"
  },
  {
    "source": {
      "id": null,
      "name": "Brickset.com"
    },
    "author": "Huwbot",
    "title": "Random set of the day: Winter Village Bakery",
    "description": "Today's random set is 10216 Winter Village Bakery, released during 2010. It's one of 6 Advanced models sets produced that year. It contains 687 pieces and 7 minifigs, and its retail price was US$54.99/£50.99. It's owned by 11,333 Brickset members. If you want…",
    "url": "https://brickset.com/article/114645/random-set-of-the-day-winter-village-bakery",
    "urlToImage": "https://brickset.com/utils/ogimage/set/10216-1",
    "publishedAt": "2024-10-18T02:01:02Z",
    "content": "Posted by Huwbot, 18 Oct 2024 03:01\r\nToday's random set is 10216 Winter Village Bakery, released during 2010. It's one of 6 Advanced models sets produced that year. It contains 687 pieces and 7 minif… [+552 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Random set of the day Winter Village Bakery Todays random set is 10216 Winter Village Bakery, released during 2010. Its one of 6 Advanced models sets produced that year. It contains 687 pieces and 7 minifigs, and its retail price was US54.9950.99. Its owned by 11,333 Brickset members. If you want Posted by Huwbot, 18 Oct 2024 0301 Todays random set is 10216 Winter Village Bakery, released during 2010. Its one of 6 Advanced models sets produced that year. It contains 687 pieces and 7 minif"
  },
  {
    "source": {
      "id": null,
      "name": "The Diplomat"
    },
    "author": "Sebastian Strangio",
    "title": "Vietnam Sentences Businesswoman to Life in Prison in Mega-Fraud Trial",
    "description": "Truong My Lan, 68, is already on death row for masterminding the embezzlement of $26.8 billion from Saigon Commercial Bank.",
    "url": "https://thediplomat.com/2024/10/vietnam-sentences-businesswoman-to-life-in-prison-in-mega-fraud-trial/",
    "urlToImage": "https://thediplomat.com/wp-content/uploads/2024/10/sizes/td-story-s-2/thediplomat_2024-10-18-003356.jpg",
    "publishedAt": "2024-10-18T04:30:35Z",
    "content": "Businesswoman Truong My Lan was sentenced to life in prison yesterday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported.\r\nIn a heari… [+6558 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Vietnam Sentences Businesswoman to Life in Prison in Mega-Fraud Trial Truong My Lan, 68, is already on death row for masterminding the embezzlement of 26.8 billion from Saigon Commercial Bank. Businesswoman Truong My Lan was sentenced to life in prison yesterday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported. In a heari"
  },
  {
    "source": {
      "id": null,
      "name": "Techreport.com"
    },
    "author": "Rida Fatima",
    "title": "Stablecoin Use Drops on US Exchanges as Global Platforms See Surge in 2024",
    "description": "The United States has witnessed increased demand for Bitcoin since the launch of spot BTC ETFs in January. These financial products attracted significant interest from investors. However, a recent report...\nThe post Stablecoin Use Drops on US Exchanges as Glo…",
    "url": "https://techreport.com/crypto-news/stablecoin-use-drops-on-us-exchanges-as-global-platforms-see-surge-in-2024/",
    "urlToImage": "https://techreport.com/wp-content/uploads/2023/08/stablecoin-overview-banner.jpg?_t=1729213471",
    "publishedAt": "2024-10-18T00:59:30Z",
    "content": "The United States has witnessed increased demand for Bitcoin since the launch of spot BTC ETFs in January. These financial products attracted significant interest from investors.\r\nHowever, a recent r… [+3411 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Stablecoin Use Drops on US Exchanges as Global Platforms See Surge in 2024 The United States has witnessed increased demand for Bitcoin since the launch of spot BTC ETFs in January. These financial products attracted significant interest from investors. However, a recent report... The post Stablecoin Use Drops on US Exchanges as Glo The United States has witnessed increased demand for Bitcoin since the launch of spot BTC ETFs in January. These financial products attracted significant interest from investors. However, a recent r"
  },
  {
    "source": {
      "id": null,
      "name": "International Business Times"
    },
    "author": "AFP News",
    "title": "Japan's Core Inflation Rate Slows In September",
    "description": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.",
    "url": "https://www.ibtimes.com/japans-core-inflation-rate-slows-september-3747160",
    "urlToImage": "https://d.ibtimes.com/en/full/4554976/japanese-inflation-has-been-above-central-banks-two-percent-target-since-april-2022.jpg",
    "publishedAt": "2024-10-18T03:47:45Z",
    "content": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.\r\nThe core Consumer Price Index eased from 2.8 percent in Aug… [+1763 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Japans Core Inflation Rate Slows In September Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in Aug"
  },
  {
    "source": {
      "id": null,
      "name": "Project Syndicate"
    },
    "author": "James Livingston",
    "title": "The Brutes’ New Suits",
    "description": "Today's leading financial observers, from left to right, depict a banking sector teeming with bespoke-suited knaves willing to mortgage their mothers’ souls. As several recent books make clear, violation of rules has become deeply integrated into banks' busin…",
    "url": "https://www.project-syndicate.org/onpoint/consensus-that-banks-are-running-long-con-game-by-james-livingston-2024-10",
    "urlToImage": "https://webapi.project-syndicate.org/library/704eba0d2f931f5485b9fa9377cf6ebe.2-1-super.1.jpg",
    "publishedAt": "2024-10-18T08:17:02Z",
    "content": "Today's leading financial observers, from left to right, depict a banking sector teeming with bespoke-suited knaves willing to mortgage their mothers souls. As several recent books make clear, violat… [+21794 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "The Brutes New Suits Todays leading financial observers, from left to right, depict a banking sector teeming with bespoke-suited knaves willing to mortgage their mothers souls. As several recent books make clear, violation of rules has become deeply integrated into banks busin Todays leading financial observers, from left to right, depict a banking sector teeming with bespoke-suited knaves willing to mortgage their mothers souls. As several recent books make clear, violat"
  },
  {
    "source": {
      "id": null,
      "name": "International Business Times"
    },
    "author": "Tonye BAKARE, Leslie FAUVEL",
    "title": "Nigerians Sacrifice Cars As Cost Of Living Crisis Worsens",
    "description": "Nigeria's economic crisis and soaring petrol prices forced Bolaji Emmanuel to give up his driver and his Honda Pilot utility vehicle, as he struggles with spiking living costs.",
    "url": "https://www.ibtimes.com/nigerians-sacrifice-cars-cost-living-crisis-worsens-3747173",
    "urlToImage": "https://d.ibtimes.com/en/full/4555001/some-are-turning-bicycles-despite-lack-appropriate-infrastructure-major-cities-like-lagos.jpg",
    "publishedAt": "2024-10-18T05:21:16Z",
    "content": "Nigeria's economic crisis and soaring petrol prices forced Bolaji Emmanuel to give up his driver and his Honda Pilot utility vehicle, as he struggles with spiking living costs.\r\nEmmanuel is not alone… [+3816 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Nigerians Sacrifice Cars As Cost Of Living Crisis Worsens Nigerias economic crisis and soaring petrol prices forced Bolaji Emmanuel to give up his driver and his Honda Pilot utility vehicle, as he struggles with spiking living costs. Nigerias economic crisis and soaring petrol prices forced Bolaji Emmanuel to give up his driver and his Honda Pilot utility vehicle, as he struggles with spiking living costs. Emmanuel is not alone"
  },
  {
    "source": {
      "id": null,
      "name": "Japan Today"
    },
    "author": null,
    "title": "Japan's core inflation rate slows in September",
    "description": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in August as the pace of increase in electricity and gas prices rel…",
    "url": "https://japantoday.com/category/business/japan%27s-core-inflation-rate-slows-in-september",
    "urlToImage": null,
    "publishedAt": "2024-10-18T07:35:12Z",
    "content": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.\r\nThe core Consumer Price Index eased from 2.8 percent in Aug… [+1773 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Japans core inflation rate slows in September Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in August as the pace of increase in electricity and gas prices rel Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in Aug"
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "HMS Networks AB",
    "title": "Interim report 2024, January – September",
    "description": "Third quarter     Order intake for the third quarter increased by 37% to SEK 677 m (492). Organically, order intake decreased by 8% and currency......",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965332/0/en/Interim-report-2024-January-September.html",
    "urlToImage": "https://ml-eu.globenewswire.com/Resource/Download/c0d357df-b775-43b4-9711-2db8348c7128",
    "publishedAt": "2024-10-18T05:30:00Z",
    "content": "Third quarter \r\n<ul><li>Order intake for the third quarter increased by 37% to SEK 677 m (492). Organically, order intake decreased by 8% and currency translations affected by -4%</li><li>Net sales i… [+8740 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Interim report 2024, January  September Third quarter Order intake for the third quarter increased by 37 to SEK 677 m 492. Organically, order intake decreased by 8 and currency...... Third quarter Order intake for the third quarter increased by 37 to SEK 677 m 492. Organically, order intake decreased by 8 and currency translations affected by -4Net sales i"
  },
  {
    "source": {
      "id": "abc-news",
      "name": "ABC News"
    },
    "author": "The Associated Press",
    "title": "Egypt increases fuel prices by 10% to 17%",
    "description": "Egypt has raised fuel prices by between 10% and 17%, a move likely to impact the cost of both goods and services",
    "url": "https://abcnews.go.com/International/wireStory/egypt-increases-fuel-prices-10-17-114920292",
    "urlToImage": "https://i.abcnewsfe.com/a/c2569d5a-9bac-42f6-93cb-dd2fdb779487/wirestory_2744cb224074a59b909060e798d9bbf6_16x9.jpg?w=1600",
    "publishedAt": "2024-10-18T10:46:25Z",
    "content": "CAIRO -- Egypt raised fuel prices Friday by between 10% and 17%, a move likely to impact the cost of both goods and services. \r\nThe Egyptian government said in a statement on Facebook that the decisi… [+1249 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Egypt increases fuel prices by 10 to 17 Egypt has raised fuel prices by between 10 and 17, a move likely to impact the cost of both goods and services CAIRO -- Egypt raised fuel prices Friday by between 10 and 17, a move likely to impact the cost of both goods and services. The Egyptian government said in a statement on Facebook that the decisi"
  },
  {
    "source": {
      "id": null,
      "name": "Theflightdeal.com"
    },
    "author": "The Flight Deal",
    "title": "Korean Air: San Francisco – Chiang Mai, Thailand. $780. Roundtrip, including all Taxes",
    "description": "A good sale to Chiang Mai. Pricing will vary slightly depending on routingSample Travel Date:February 20th - 27th, 2025This is just ONE SAMPLE travel date, for more availab",
    "url": "https://www.theflightdeal.com/2024/10/18/korean-air-san-francisco-chiang-mai-thailand-780-roundtrip-including-all-taxes/",
    "urlToImage": "https://www.theflightdeal.com/wp-content/uploads/2014/09/chiang_mai_yi_peng-640x390.jpg",
    "publishedAt": "2024-10-18T17:25:36Z",
    "content": "A good sale to Chiang Mai. Pricing will vary slightly depending on routing\r\nSign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted… [+3520 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Korean Air San Francisco  Chiang Mai, Thailand. 780. Roundtrip, including all Taxes A good sale to Chiang Mai. Pricing will vary slightly depending on routingSample Travel DateFebruary 20th - 27th, 2025This is just ONE SAMPLE travel date, for more availab A good sale to Chiang Mai. Pricing will vary slightly depending on routing Sign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "CME Group Inc. (NASDAQ:CME) Shares Acquired by Swedbank AB",
    "description": "Swedbank AB increased its position in shares of CME Group Inc. (NASDAQ:CME – Free Report) by 0.8% during the 3rd quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission. The fund owned 71,050 shares of the f…",
    "url": "https://www.etfdailynews.com/2024/10/18/cme-group-inc-nasdaqcme-shares-acquired-by-swedbank-ab/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/cme-group-inc-logo-1200x675.png?v=20221021141708&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T15:24:43Z",
    "content": "Swedbank AB increased its position in shares of CME Group Inc. (NASDAQ:CME – Free Report) by 0.8% during the 3rd quarter, according to the company in its most recent 13F filing with the Securities an… [+7058 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "CME Group Inc. NASDAQCME Shares Acquired by Swedbank AB Swedbank AB increased its position in shares of CME Group Inc. NASDAQCME  Free Report by 0.8 during the 3rd quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission. The fund owned 71,050 shares of the f Swedbank AB increased its position in shares of CME Group Inc. NASDAQCME  Free Report by 0.8 during the 3rd quarter, according to the company in its most recent 13F filing with the Securities an"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "PTI",
    "title": "Rupee slips 1 paisa to 84.07 against US dollar in early trade",
    "description": "The rupee dropped 1 paisa to 84.07 against the US dollar amid negative domestic equity markets and higher crude oil prices. Weakening of the American currency and the continual outflow of foreign funds contributed to the decline. Sensex fell by 372.10 points …",
    "url": "https://economictimes.indiatimes.com/markets/forex/rupee-slips-1-paisa-to-84-07-against-us-dollar-in-early-trade/articleshow/114338233.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114338254,width-1200,height-630,imgsize-2130075,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T05:32:28Z",
    "content": "(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2024 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets… [+317 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Rupee slips 1 paisa to 84.07 against US dollar in early trade The rupee dropped 1 paisa to 84.07 against the US dollar amid negative domestic equity markets and higher crude oil prices. Weakening of the American currency and the continual outflow of foreign funds contributed to the decline. Sensex fell by 372.10 points Whats moving Sensex and Nifty Track latest market news, stock tips, Budget 2024 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Umar Farooq",
    "title": "Payoneer Global Inc. (PAYO): This Fintech Stock Is Riding the AI Wave Higher",
    "description": "We recently compiled a list of the 20 Fintech Stocks Riding the AI Wave Higher. In this article, we are going to take a look at where Payoneer Global Inc...",
    "url": "https://finance.yahoo.com/news/payoneer-global-inc-payo-fintech-084242037.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/oEbJgLoSVhzMRX1W__ZxNw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/9ea36b962e83f7f0f822923f51cffc77",
    "publishedAt": "2024-10-18T08:42:42Z",
    "content": "We recently compiled a list of the 20 Fintech Stocks Riding the AI Wave Higher. In this article, we are going to take a look at where Payoneer Global Inc. (NASDAQ:PAYO) stands against the other finte… [+10364 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Payoneer Global Inc. PAYO This Fintech Stock Is Riding the AI Wave Higher We recently compiled a list of the 20 Fintech Stocks Riding the AI Wave Higher. In this article, we are going to take a look at where Payoneer Global Inc... We recently compiled a list of the 20 Fintech Stocks Riding the AI Wave Higher. In this article, we are going to take a look at where Payoneer Global Inc. NASDAQPAYO stands against the other finte"
  },
  {
    "source": {
      "id": null,
      "name": "[Removed]"
    },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-18T16:19:28Z",
    "content": "[Removed]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Removed"
  },
  {
    "source": {
      "id": null,
      "name": "International Business Times"
    },
    "author": "AFP News",
    "title": "Asian Markets Swing As China Economic Growth Slows",
    "description": "Asian markets fluctuated Friday after China posted its weakest economic growth in a year and a half, as gold prices hit a record high and following a tepid lead from Wall Street.",
    "url": "https://www.ibtimes.com/asian-markets-swing-china-economic-growth-slows-3747159",
    "urlToImage": "https://d.ibtimes.com/en/full/4554975/while-chinese-economy-grew-its-slowest-pace-since-early-2023-data-also-showed-pick-retail.jpg",
    "publishedAt": "2024-10-18T03:18:16Z",
    "content": "Asian markets fluctuated Friday after China posted its weakest economic growth in a year and a half, as gold prices hit a record high and following a tepid lead from Wall Street.\r\nInvestors have been… [+2870 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Asian Markets Swing As China Economic Growth Slows Asian markets fluctuated Friday after China posted its weakest economic growth in a year and a half, as gold prices hit a record high and following a tepid lead from Wall Street. Asian markets fluctuated Friday after China posted its weakest economic growth in a year and a half, as gold prices hit a record high and following a tepid lead from Wall Street. Investors have been"
  },
  {
    "source": {
      "id": null,
      "name": "International Business Times"
    },
    "author": "Luke Funk",
    "title": "FBI Says Olympic Snowboarder Wanted For Running Murderous Drug Ring",
    "description": "Ryan James Wedding is one of 16 defendants facing charges in connection with the international drug trafficking scheme.",
    "url": "https://www.ibtimes.com/olympic-snowboarder-ryan-james-wedding-drug-murder-fbi-3747230",
    "urlToImage": "https://d.ibtimes.com/en/full/4555109/ryan-wedding.jpg",
    "publishedAt": "2024-10-18T14:13:57Z",
    "content": "A former Olympic snowboarder from Canada and 15 others have been charged for allegedly running a transnational drug trafficking operation that shipped hundreds of kilograms of cocaine from Colombia t… [+3774 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "FBI Says Olympic Snowboarder Wanted For Running Murderous Drug Ring Ryan James Wedding is one of 16 defendants facing charges in connection with the international drug trafficking scheme. A former Olympic snowboarder from Canada and 15 others have been charged for allegedly running a transnational drug trafficking operation that shipped hundreds of kilograms of cocaine from Colombia t"
  },
  {
    "source": {
      "id": null,
      "name": "Gematsu"
    },
    "author": "Sal Romano",
    "title": "CARRION coming to iOS, Android",
    "description": "Publisher Devolver Dgiital and developer Phobia Game Studio will release iOS and Android versions of CARRION on October 31, the companies announced. Pre-registration is available now via App Store …",
    "url": "https://www.gematsu.com/2024/10/carrion-coming-to-ios-android",
    "urlToImage": "https://www.gematsu.com/wp-content/uploads/2024/10/CARRION-Mobile_10-18-24.jpg",
    "publishedAt": "2024-10-18T16:15:55Z",
    "content": "Publisher Devolver Dgiital and developer Phobia Game Studio will release iOS and Android versions of CARRION on October 31, the companies announced. Pre-registration is available now via App Store an… [+792 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "CARRION coming to iOS, Android Publisher Devolver Dgiital and developer Phobia Game Studio will release iOS and Android versions of CARRION on October 31, the companies announced. Pre-registration is available now via App Store Publisher Devolver Dgiital and developer Phobia Game Studio will release iOS and Android versions of CARRION on October 31, the companies announced. Pre-registration is available now via App Store an"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Yoshiaki Nohara and Keiko Ujikane",
    "title": "Japan’s Inflation Slows for First Time Since April Ahead of BOJ",
    "description": "(Bloomberg) -- Japan’s key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the ...",
    "url": "https://finance.yahoo.com/news/japan-inflation-slows-first-time-234833173.html",
    "urlToImage": "https://media.zenfs.com/en/bloomberg_markets_842/f5d1ab03f56411d8b64950fd0ed7c381",
    "publishedAt": "2024-10-18T00:51:05Z",
    "content": "(Bloomberg) -- Japans key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the board is widely expected to keep the intere… [+4158 chars]",
    "categories": [
      "Monetary Policy",
      "Economic Indicators"
    ],
    "full_description": "Japans Inflation Slows for First Time Since April Ahead of BOJ Bloomberg -- Japans key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the ... Bloomberg -- Japans key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the board is widely expected to keep the intere"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "editorial-team@simplywallst.com (Simply Wall St)",
    "title": "Exploring 3 High Growth Tech Stocks in Japan",
    "description": "Japan's stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45% and the broader TOPIX Index up 0.45%, supported by yen...",
    "url": "https://finance.yahoo.com/news/exploring-3-high-growth-tech-050630301.html",
    "urlToImage": "https://media.zenfs.com/en/simply_wall_st__316/fbcb1fb47846c704491b7cdca16e4528",
    "publishedAt": "2024-10-18T05:06:30Z",
    "content": "Japan's stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45% and the broader TOPIX Index up 0.45%, supported by yen weakness that has improved profit outlooks … [+5977 chars]",
    "categories": [
      "Currency Specific",
      "Market Sentiment"
    ],
    "full_description": "Exploring 3 High Growth Tech Stocks in Japan Japans stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45 and the broader TOPIX Index up 0.45, supported by yen... Japans stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45 and the broader TOPIX Index up 0.45, supported by yen weakness that has improved profit outlooks"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "CX Institutional Grows Position in ProShares Bitcoin ETF (NYSEARCA:BITO)",
    "description": "CX Institutional raised its position in ProShares Bitcoin ETF (NYSEARCA:BITO – Free Report) by 17.7% during the third quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The firm owned 20,277 shares of the company’s…",
    "url": "https://www.etfdailynews.com/2024/10/18/cx-institutional-grows-position-in-proshares-bitcoin-etf-nysearcabito/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/proshares-bitcoin-strategy-etf-logo-1200x675.png?v=20211203144316&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T10:28:48Z",
    "content": "CX Institutional raised its position in ProShares Bitcoin ETF (NYSEARCA:BITO – Free Report) by 17.7% during the third quarter, according to its most recent filing with the Securities and Exchange Com… [+2602 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "CX Institutional Grows Position in ProShares Bitcoin ETF NYSEARCABITO CX Institutional raised its position in ProShares Bitcoin ETF NYSEARCABITO  Free Report by 17.7 during the third quarter, according to its most recent filing with the Securities and Exchange Commission SEC. The firm owned 20,277 shares of the companys CX Institutional raised its position in ProShares Bitcoin ETF NYSEARCABITO  Free Report by 17.7 during the third quarter, according to its most recent filing with the Securities and Exchange Com"
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "economist.com",
    "title": "Call me MacWages: An alternative use for The Economist’s Big Mac index",
    "description": "An alternative use for The Economist’s Big Mac index\nWhich countries have the highest purchasing power?\nSINCE 1986 The Economist has produced the Big Mac index as a light-hearted gauge of whether currencies are at their “correct” level. The famous burger is a…",
    "url": "https://biztoc.com/x/2c11b7d3369141fc",
    "urlToImage": "https://biztoc.com/cdn/805/og.png",
    "publishedAt": "2024-10-18T17:02:12Z",
    "content": "An alternative use for The Economists Big Mac indexWhich countries have the highest purchasing power?SINCE 1986 The Economist has produced the Big Mac index as a light-hearted gauge of whether curren… [+136 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Call me MacWages An alternative use for The Economists Big Mac index An alternative use for The Economists Big Mac index Which countries have the highest purchasing power? SINCE 1986 The Economist has produced the Big Mac index as a light-hearted gauge of whether currencies are at their correct level. The famous burger is a An alternative use for The Economists Big Mac indexWhich countries have the highest purchasing power?SINCE 1986 The Economist has produced the Big Mac index as a light-hearted gauge of whether curren"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Vanguard Total International Bond ETF (NASDAQ:BNDX) Stock Position Decreased by SeaCrest Wealth Management LLC",
    "description": "SeaCrest Wealth Management LLC reduced its stake in shares of Vanguard Total International Bond ETF (NASDAQ:BNDX – Free Report) by 2.3% in the third quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (S…",
    "url": "https://www.etfdailynews.com/2024/10/18/vanguard-total-international-bond-etf-nasdaqbndx-stock-position-decreased-by-seacrest-wealth-management-llc/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/vanguard-total-international-bond-etf-logo-1200x675.jpg?v=20240102162643&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T12:32:52Z",
    "content": "SeaCrest Wealth Management LLC reduced its stake in shares of Vanguard Total International Bond ETF (NASDAQ:BNDX – Free Report) by 2.3% in the third quarter, according to the company in its most rece… [+2820 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Vanguard Total International Bond ETF NASDAQBNDX Stock Position Decreased by SeaCrest Wealth Management LLC SeaCrest Wealth Management LLC reduced its stake in shares of Vanguard Total International Bond ETF NASDAQBNDX  Free Report by 2.3 in the third quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission S SeaCrest Wealth Management LLC reduced its stake in shares of Vanguard Total International Bond ETF NASDAQBNDX  Free Report by 2.3 in the third quarter, according to the company in its most rece"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "mfox@businessinsider.com (Matthew Fox)",
    "title": "5 things to know about the mystery $30 million whale moving betting markets towards Trump",
    "description": "Four Polymarket accounts that appear to be connected have bet $30 million that Trump will win the election, according to Arkham Intelligence.",
    "url": "https://www.businessinsider.com/trump-election-odds-polymarket-whale-kamala-harris-polls-betting-markets-2024-10",
    "urlToImage": "https://i.insider.com/671279cd01ea6d83dee23257?width=1200&format=jpeg",
    "publishedAt": "2024-10-18T17:21:17Z",
    "content": "With the Presidential election less than three weeks away, polls are in a virtual dead heat between candidates Donald Trump and Kamala Harris.\r\nBut the election odds look somewhat different in the pr… [+5262 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "5 things to know about the mystery 30 million whale moving betting markets towards Trump Four Polymarket accounts that appear to be connected have bet 30 million that Trump will win the election, according to Arkham Intelligence. With the Presidential election less than three weeks away, polls are in a virtual dead heat between candidates Donald Trump and Kamala Harris. But the election odds look somewhat different in the pr"
  },
  {
    "source": {
      "id": null,
      "name": "Theflightdeal.com"
    },
    "author": "The Flight Deal",
    "title": "American: Dallas – Dublin, Ireland. $497 (Basic Economy) / $697 (Regular Economy). Roundtrip, including all Taxes",
    "description": "A good sale to Dublin. Pricing will vary slightly depending on routing.Matrix Airfare Search by ITA Software will price this at $697 (Basic Economy). Use those dates on  American  should reprice",
    "url": "https://www.theflightdeal.com/2024/10/18/american-dallas-dublin-ireland-497-basic-economy-697-regular-economy-roundtrip-including-all-taxes/",
    "urlToImage": "https://www.theflightdeal.com/wp-content/uploads/2014/08/dublin_august-640x390.jpg",
    "publishedAt": "2024-10-18T15:25:16Z",
    "content": "A good sale to Dublin. Pricing will vary slightly depending on routing.\r\nMatrix Airfare Search by ITA Software will price this at $697 (Basic Economy). Use those dates on  American  should reprice to… [+4638 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "American Dallas  Dublin, Ireland. 497 Basic Economy  697 Regular Economy. Roundtrip, including all Taxes A good sale to Dublin. Pricing will vary slightly depending on routing.Matrix Airfare Search by ITA Software will price this at 697 Basic Economy. Use those dates on American should reprice A good sale to Dublin. Pricing will vary slightly depending on routing. Matrix Airfare Search by ITA Software will price this at 697 Basic Economy. Use those dates on American should reprice to"
  },
  {
    "source": {
      "id": null,
      "name": "Theflightdeal.com"
    },
    "author": "The Flight Deal",
    "title": "Scandinavian Airlines: Miami – Paris, France. $481 (Basic Economy) / $516 (Regular Economy). Roundtrip, including all Taxes",
    "description": "A good sale to ParisMatrix Airfare Search by ITA Software will price this at $493 (Basic Economy). Use those dates on  Scandinavian should reprice to $481 (Basic Economy) / $516 (Regular Economy)",
    "url": "https://www.theflightdeal.com/2024/10/18/scandinavian-airlines-miami-paris-france-481-basic-economy-516-regular-economy-roundtrip-including-all-taxes/",
    "urlToImage": "https://www.theflightdeal.com/wp-content/uploads/2018/01/paris_al_grande-940x390.jpeg",
    "publishedAt": "2024-10-18T14:25:00Z",
    "content": "A good sale to Paris\r\nMatrix Airfare Search by ITA Software will price this at $493 (Basic Economy). Use those dates on  Scandinavian should reprice to $481 (Basic Economy) / $516 (Regular Economy).\r… [+5347 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Scandinavian Airlines Miami  Paris, France. 481 Basic Economy  516 Regular Economy. Roundtrip, including all Taxes A good sale to ParisMatrix Airfare Search by ITA Software will price this at 493 Basic Economy. Use those dates on Scandinavian should reprice to 481 Basic Economy  516 Regular Economy A good sale to Paris Matrix Airfare Search by ITA Software will price this at 493 Basic Economy. Use those dates on Scandinavian should reprice to 481 Basic Economy  516 Regular Economy."
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "MidCap Financial Investment Corporation",
    "title": "MidCap Financial Investment Corporation Amends and Extends Its Senior Secured Revolving Credit Facility",
    "description": "NEW YORK, Oct. 18, 2024 (GLOBE NEWSWIRE) -- MidCap Financial Investment Corporation (NASDAQ: MFIC) (the “Company”) announced today that it has amended and extended its senior secured, multi-currency, revolving credit facility (the “Facility”). Lender commitme…",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965529/0/en/MidCap-Financial-Investment-Corporation-Amends-and-Extends-Its-Senior-Secured-Revolving-Credit-Facility.html",
    "urlToImage": "https://ml.globenewswire.com/Resource/Download/178161c8-7e0a-4946-980b-7b38e8203830",
    "publishedAt": "2024-10-18T12:40:00Z",
    "content": "NEW YORK, Oct. 18, 2024 (GLOBE NEWSWIRE) -- MidCap Financial Investment Corporation (NASDAQ: MFIC) (the Company) announced today that it has amended and extended its senior secured, multi-currency, r… [+4605 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "MidCap Financial Investment Corporation Amends and Extends Its Senior Secured Revolving Credit Facility NEW YORK, Oct. 18, 2024 GLOBE NEWSWIRE -- MidCap Financial Investment Corporation NASDAQ MFIC the Company announced today that it has amended and extended its senior secured, multi-currency, revolving credit facility the Facility. Lender commitme NEW YORK, Oct. 18, 2024 GLOBE NEWSWIRE -- MidCap Financial Investment Corporation NASDAQ MFIC the Company announced today that it has amended and extended its senior secured, multi-currency, r"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Samuel Edyme",
    "title": "Ireland To Draft Urgent Crypto Laws Ahead Of EU’s Crackdown On Money Laundering",
    "description": "Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Union’s upcoming Anti-Money Laundering (AML) and counter-terrorism financing (CTF) standards. Finance Minister Jack Chambers announced to the cabinet…",
    "url": "https://bitcoinist.com/ireland-to-draft-urgent-crypto-laws-of-eu-crackdown/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2024/10/DALL·E-2024-10-17-15.42.37-A-digital-illustration-depicting-Ireland-drafting-urgent-crypto-laws-ahead-of-the-EUs-crackdown-on-money-laundering.-The-image-features-symbols-of-cr.webp",
    "publishedAt": "2024-10-18T07:00:40Z",
    "content": "Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Unions upcoming Anti-Money Laundering (AML) and counter-terrorism financing (CTF) standar… [+3165 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Ireland To Draft Urgent Crypto Laws Ahead Of EUs Crackdown On Money Laundering Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Unions upcoming Anti-Money Laundering AML and counter-terrorism financing CTF standards. Finance Minister Jack Chambers announced to the cabinet Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Unions upcoming Anti-Money Laundering AML and counter-terrorism financing CTF standar"
  },
  {
    "source": {
      "id": null,
      "name": "Incrediblethings.com"
    },
    "author": "Muhammad Abdul Razzak Chowdhury",
    "title": "The Best Gambling Hotspots To Visit Around the World",
    "description": "As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using the same online casino websites can start to be a bit tedious …",
    "url": "https://incrediblethings.com/site/reviews/the-best-gambling-hotspots-to-visit-around-the-world/",
    "urlToImage": "https://incrediblethings.com/wp-content/uploads/2024/05/bigstock-Online-Gambling-21660203.jpg",
    "publishedAt": "2024-10-18T10:36:00Z",
    "content": "As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using th… [+4557 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "The Best Gambling Hotspots To Visit Around the World As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using the same online casino websites can start to be a bit tedious As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using th"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ETMarkets.com",
    "title": "Stock to Watch: Wipro shares in focus after co posts 21% YoY jump in Q2 PAT",
    "description": "Wipro Share Price: Wipro reports a 21% rise in net profit to Rs 3,209 crore for Q2 FY2024, surpassing estimates. Revenue from operations stood at Rs 22,302 crore, slightly down from last year. Outlook for Q3 anticipates IT Services revenue between $2,607 mill…",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-wipro-shares-in-focus-after-co-posts-21-yoy-jump-in-q2-pat/articleshow/114333641.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114333623,width-1200,height-630,imgsize-28732,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T03:07:45Z",
    "content": "Shares of Wipro will be in focus on Friday following IT major's July-September quarter earnings where the company reported a 21% jump in net profit to Rs 3,209 crore for the quarter ended September 2… [+2008 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Stock to Watch Wipro shares in focus after co posts 21 YoY jump in Q2 PAT Wipro Share Price Wipro reports a 21 rise in net profit to Rs 3,209 crore for Q2 FY2024, surpassing estimates. Revenue from operations stood at Rs 22,302 crore, slightly down from last year. Outlook for Q3 anticipates IT Services revenue between 2,607 mill Shares of Wipro will be in focus on Friday following IT majors July-September quarter earnings where the company reported a 21 jump in net profit to Rs 3,209 crore for the quarter ended September 2"
  },
  {
    "source": {
      "id": null,
      "name": "Hurriyet Daily News"
    },
    "author": "hurriyetdailynews.com",
    "title": "Erdoğan stresses need to broaden dialogue, unity in Türkiye",
    "description": "President Recep Tayyip Erdoğan has underscored the necessity for Türkiye to broaden dialogue within society during the period of escalating tensions in the region, saying that unity is key to resolving regional issues.",
    "url": "https://www.hurriyetdailynews.com/erdogan-stresses-need-to-broaden-dialogue-unity-in-turkiye-201690",
    "urlToImage": "https://image.hurimg.com/i/hurriyet/75/200x200/67125d19266802cd351baee4.jpg",
    "publishedAt": "2024-10-18T13:05:35Z",
    "content": "ISTANBUL\r\nPresident Recep Tayyip Erdoan has underscored the necessity for Türkiye to broaden dialogue within society during the period of escalating tensions in the region, saying that unity is key t… [+2469 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Erdoğan stresses need to broaden dialogue, unity in Türkiye President Recep Tayyip Erdoğan has underscored the necessity for Türkiye to broaden dialogue within society during the period of escalating tensions in the region, saying that unity is key to resolving regional issues. ISTANBUL President Recep Tayyip Erdoan has underscored the necessity for Türkiye to broaden dialogue within society during the period of escalating tensions in the region, saying that unity is key t"
  },
  {
    "source": {
      "id": null,
      "name": "Coinjournal.net"
    },
    "author": "Benson Toti",
    "title": "Dogecoin (DOGE) price up as meme coins rise",
    "description": "Dogecoin price spiked double-digits in 24 hours to hit its highest level in close to three months. DOGE price broke above $0.13, above levels seen in July as several meme coins surged. While the meme coin’s price rose amid broader optimism in the crypto marke…",
    "url": "https://coinjournal.net/news/dogecoin-doge-price-up-as-meme-coins-rise/",
    "urlToImage": "https://coinjournal.net/wp-content/uploads/2024/01/1690227506184-e1cf39bf-4928-4da1-922f-475ddf635a1c.jpg",
    "publishedAt": "2024-10-18T10:52:44Z",
    "content": "Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates and/or business partners of this site and/or its owners, op… [+2173 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Dogecoin DOGE price up as meme coins rise Dogecoin price spiked double-digits in 24 hours to hit its highest level in close to three months. DOGE price broke above 0.13, above levels seen in July as several meme coins surged. While the meme coins price rose amid broader optimism in the crypto marke Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates andor business partners of this site andor its owners, op"
  },
  {
    "source": {
      "id": null,
      "name": "Coinjournal.net"
    },
    "author": "Benson Toti",
    "title": "Worldcoin rebrands, launches World Chain mainnet",
    "description": "Worldcoin has rebranded to ‘World’ and introduced several new features to enhance its World ID. The project also announced the mainnet launch of its blockchain World Chain. Worldcoin is now simply “World” after the blockchain-based identity verification proje…",
    "url": "https://coinjournal.net/news/worldcoin-rebrands-launches-world-chain-mainnet/",
    "urlToImage": "https://coinjournal.net/wp-content/uploads/2024/04/Sam-Altmans-Worldcoin-eyes-PayPal-and-OpenAI-partnerships.jpg",
    "publishedAt": "2024-10-18T08:18:23Z",
    "content": "Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates and/or business partners of this site and/or its owners, op… [+2173 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Worldcoin rebrands, launches World Chain mainnet Worldcoin has rebranded to World and introduced several new features to enhance its World ID. The project also announced the mainnet launch of its blockchain World Chain. Worldcoin is now simply World after the blockchain-based identity verification proje Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates andor business partners of this site andor its owners, op"
  },
  {
    "source": {
      "id": null,
      "name": "Incrediblethings.com"
    },
    "author": "Muhammad Abdul Razzak Chowdhury",
    "title": "The Best Gambling Hotspots To Visit Around the World",
    "description": "As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using the same online casino websites can start to be a bit tedious …",
    "url": "https://incrediblethings.com/money/casino/the-best-gambling-hotspots-to-visit-around-the-world/",
    "urlToImage": "https://incrediblethings.com/wp-content/uploads/2024/05/bigstock-Online-Gambling-21660203.jpg",
    "publishedAt": "2024-10-18T10:36:00Z",
    "content": "As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using th… [+4565 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "The Best Gambling Hotspots To Visit Around the World As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using the same online casino websites can start to be a bit tedious As you know, some of the best and most entertaining things to do are play casino games, like slots, blackjack and poker, and place sports bets. However, sometimes going to the same casino or using th"
  },
  {
    "source": {
      "id": null,
      "name": "Globalsecurity.org"
    },
    "author": "John Pike",
    "title": "Life sentence for Vietnamese tycoon already facing death penalty",
    "description": "Businesswoman Truong My Lan was sentenced to life in prison on Thursday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported.",
    "url": "https://www.globalsecurity.org/military/library/news/2024/10/mil-241017-rfa02.htm",
    "urlToImage": null,
    "publishedAt": "2024-10-18T07:04:17Z",
    "content": "Truong My Lan was found guilty of swindling tens of thousands of investors in the country's biggest fraud case.\r\nBy Mike Firn for RFA 2024.10.17 -- Businesswoman Truong My Lan was sentenced to life i… [+2278 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Life sentence for Vietnamese tycoon already facing death penalty Businesswoman Truong My Lan was sentenced to life in prison on Thursday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported. Truong My Lan was found guilty of swindling tens of thousands of investors in the countrys biggest fraud case. By Mike Firn for RFA 2024.10.17 -- Businesswoman Truong My Lan was sentenced to life i"
  },
  {
    "source": {
      "id": null,
      "name": "BBC News"
    },
    "author": null,
    "title": "'My nephews died in tanker blast trying to stop petrol scoopers'",
    "description": "A farming community is in shock after more than 150 people are killed in an inferno after a tanker crash.",
    "url": "https://www.bbc.com/news/articles/ce3wx98dkxqo",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2486/live/57f053d0-8d51-11ef-89ae-5575c76d98e6.jpg",
    "publishedAt": "2024-10-18T14:04:46Z",
    "content": "Majia is in shock and most of those who died in the tanker explosion have been buried in a mass grave\r\nNigerian farmer Mustapha Majiya is still reeling from losing almost 50 members of his extended f… [+6082 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "My nephews died in tanker blast trying to stop petrol scoopers A farming community is in shock after more than 150 people are killed in an inferno after a tanker crash. Majia is in shock and most of those who died in the tanker explosion have been buried in a mass grave Nigerian farmer Mustapha Majiya is still reeling from losing almost 50 members of his extended f"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Vontobel Holding Ltd. Sells 968,502 Shares of Banco Bradesco S.A. (NYSE:BBD)",
    "description": "Vontobel Holding Ltd. cut its holdings in shares of Banco Bradesco S.A. (NYSE:BBD – Free Report) by 26.6% in the third quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The fund owned 2,673,571 sha…",
    "url": "https://www.etfdailynews.com/2024/10/18/vontobel-holding-ltd-sells-968502-shares-of-banco-bradesco-s-a-nysebbd/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/banco-bradesco-sa-logo-1200x675.png?v=20221024141153&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T12:46:50Z",
    "content": "Vontobel Holding Ltd. cut its holdings in shares of Banco Bradesco S.A. (NYSE:BBD – Free Report) by 26.6% in the third quarter, according to the company in its most recent Form 13F filing with the Se… [+4001 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Vontobel Holding Ltd. Sells 968,502 Shares of Banco Bradesco S.A. NYSEBBD Vontobel Holding Ltd. cut its holdings in shares of Banco Bradesco S.A. NYSEBBD  Free Report by 26.6 in the third quarter, according to the company in its most recent Form 13F filing with the Securities  Exchange Commission. The fund owned 2,673,571 sha Vontobel Holding Ltd. cut its holdings in shares of Banco Bradesco S.A. NYSEBBD  Free Report by 26.6 in the third quarter, according to the company in its most recent Form 13F filing with the Se"
  },
  {
    "source": {
      "id": null,
      "name": "CounterPunch"
    },
    "author": "Roger Harris",
    "title": "Cuba Under Intensified US Sanctions Confronts Its Greatest Challenge: the Continuity of Obama-Trump-Biden Policy",
    "description": "“The majority of Cubans support Castro…every possible means should be undertaken promptly to weaken the economic life of Cuba…to decrease monetary and real wages, to bring about hunger, desperation and overthrow of government.” – Lester D. Mallory, US Deputy …",
    "url": "https://www.counterpunch.org/?p=338342",
    "urlToImage": "https://www.counterpunch.org/wp-content/uploads/2021/06/cp-default-share.png",
    "publishedAt": "2024-10-18T05:55:15Z",
    "content": "The majority of Cubans support Castroevery possible means should be undertaken promptly to weaken the economic life of Cubato decrease monetary and real wages, to bring about hunger, desperation and … [+9615 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Cuba Under Intensified US Sanctions Confronts Its Greatest Challenge the Continuity of Obama-Trump-Biden Policy The majority of Cubans support Castroevery possible means should be undertaken promptly to weaken the economic life of Cubato decrease monetary and real wages, to bring about hunger, desperation and overthrow of government.  Lester D. Mallory, US Deputy The majority of Cubans support Castroevery possible means should be undertaken promptly to weaken the economic life of Cubato decrease monetary and real wages, to bring about hunger, desperation and"
  },
  {
    "source": {
      "id": null,
      "name": "Screen Rant"
    },
    "author": "Carrie Lambertsen",
    "title": "10 Things To Know About Diablo 4's Season Of Hatred Rising",
    "description": "Diablo 4s Season 6, Season of Hatred Rising, came alongside the new expansion, but still offers plenty of great content for everyone in Diablo 4.",
    "url": "https://screenrant.com/diablo-4-season-6-everything-to-know/",
    "urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2024/10/diablo-4-vessel-of-hatred-imagery-with-seething-opals.jpg",
    "publishedAt": "2024-10-18T14:50:13Z",
    "content": "Recently, Diablo 4 released its massive expansion, Vessel of Hatred, which overshadowed the fact that separate content for Season of Hatred Rising launched at the same time. Season 6 is available to … [+10183 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "10 Things To Know About Diablo 4s Season Of Hatred Rising Diablo 4s Season 6, Season of Hatred Rising, came alongside the new expansion, but still offers plenty of great content for everyone in Diablo 4. Recently, Diablo 4 released its massive expansion, Vessel of Hatred, which overshadowed the fact that separate content for Season of Hatred Rising launched at the same time. Season 6 is available to"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ET Bureau",
    "title": "Infosys net profit rises 4.7% in Q2, misses Street estimates",
    "description": "The guidance change is the sixth consecutive quarterly revision and seventh in eight quarters. Infosys is seeing a “lot of traction in financial services, which has given us good growth last quarter and this quarter,” said chief executive officer Salil Parekh…",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-net-profit-rises-4-7-in-q2-misses-street-estimates/articleshow/114331924.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114331920,width-1200,height-630,imgsize-47896,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T00:49:59Z",
    "content": "Bengaluru : Infosys, Indias second-largest IT company, posted a 4.7% increase in September quarter net profit to 6,506 crore, slightly below market estimates, from the year earlier.Some deal ramp-ups… [+3710 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Infosys net profit rises 4.7 in Q2, misses Street estimates The guidance change is the sixth consecutive quarterly revision and seventh in eight quarters. Infosys is seeing a lot of traction in financial services, which has given us good growth last quarter and this quarter, said chief executive officer Salil Parekh Bengaluru  Infosys, Indias second-largest IT company, posted a 4.7 increase in September quarter net profit to 6,506 crore, slightly below market estimates, from the year earlier.Some deal ramp-ups"
  },
  {
    "source": {
      "id": "financial-post",
      "name": "Financial Post"
    },
    "author": "The Associated Press",
    "title": "Egypt increases fuel prices by 10% to 17%",
    "description": "CAIRO (AP) — Egypt raised fuel prices Friday by between 10% and 17%, a move likely to impact the cost of both goods and services. The Egyptian government said in a statement on Facebook that the decision was made in order to “reduce the gap between the sellin…",
    "url": "https://financialpost.com/pmn/egypt-increases-fuel-prices-by-10-to-17",
    "urlToImage": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/loc102-the-associated-press.jpg",
    "publishedAt": "2024-10-18T10:36:47Z",
    "content": "CAIRO (AP) Egypt raised fuel prices Friday by between 10% and 17%, a move likely to impact the cost of both goods and services.\r\nThe Egyptian government said in a statement on Facebook that the decis… [+1251 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Egypt increases fuel prices by 10 to 17 CAIRO AP  Egypt raised fuel prices Friday by between 10 and 17, a move likely to impact the cost of both goods and services. The Egyptian government said in a statement on Facebook that the decision was made in order to reduce the gap between the sellin CAIRO AP Egypt raised fuel prices Friday by between 10 and 17, a move likely to impact the cost of both goods and services. The Egyptian government said in a statement on Facebook that the decis"
  },
  {
    "source": {
      "id": null,
      "name": "Livemint"
    },
    "author": "Varun Sood",
    "title": "Infosys poised to regain its No.2 rank as quarterly revenue edges past Cognizant",
    "description": "Infosys is on pace to reclaim its position as India’s second-largest IT services firm, with its quarterly revenue edging past Cognizant’s after a 14-year chase.",
    "url": "https://www.livemint.com/companies/company-results/infosys-poised-to-regain-its-no-2-rank-as-quarterly-revenue-edges-past-cognizant-11729170355135.html",
    "urlToImage": "https://www.livemint.com/lm-img/img/2024/10/17/1600x900/2-0-165497742-Salil-Parekh-2-0_1680879845756_1729172849847.JPG",
    "publishedAt": "2024-10-18T00:00:06Z",
    "content": "Bengaluru: Infosys Ltds latest quarterly revenue has helped it reclaim the position of Indias second-largest IT services firm, 14 years after Cognizant Technology Solutions Corp. raced ahead of Infos… [+3665 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Infosys poised to regain its No.2 rank as quarterly revenue edges past Cognizant Infosys is on pace to reclaim its position as Indias second-largest IT services firm, with its quarterly revenue edging past Cognizants after a 14-year chase. Bengaluru Infosys Ltds latest quarterly revenue has helped it reclaim the position of Indias second-largest IT services firm, 14 years after Cognizant Technology Solutions Corp. raced ahead of Infos"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "macOS HM Surf flaw in TCC allows bypass Safari privacy settings",
    "description": "Microsoft disclosed a flaw in the macOS Apple’s Transparency, Consent, and Control (TCC) framework that could allow it to bypass privacy settings and access user data. Microsoft discovered a vulnerability, tracked as CVE-2024-44133 and code-named ‘HM Surf’, i…",
    "url": "https://securityaffairs.com/169945/security/macos-hm-surf-flaw-tcc-bypass-safari-privacy-settings.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2024/10/image-19.png",
    "publishedAt": "2024-10-18T10:00:19Z",
    "content": "macOS HM Surf flaw in TCC allows bypass Safari privacy settings\r\n | Two Sudanese nationals indicted for operating the Anonymous Sudan group\r\n | Russia-linked RomCom group targeted Ukrainian governmen… [+109650 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Microsoft disclosed a flaw in the macOS Apples Transparency, Consent, and Control TCC framework that could allow it to bypass privacy settings and access user data. Microsoft discovered a vulnerability, tracked as CVE-2024-44133 and code-named HM Surf, i macOS HM Surf flaw in TCC allows bypass Safari privacy settings  Two Sudanese nationals indicted for operating the Anonymous Sudan group  Russia-linked RomCom group targeted Ukrainian governmen"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "Sutanuka Ghosal",
    "title": "Gold prices hit record high ahead of Diwali festivities",
    "description": "Gold reached a historical high of Rs 77,332 per 10 gm on Friday, surpassing the Rs 77,000 mark. The market expectation is that by Diwali, prices will cross Rs 80,000 per 10 gm mark and may even touch Rs 85,000 per 10 gm level. With the Goods & Services Tax (G…",
    "url": "https://economictimes.indiatimes.com/markets/commodities/gold-prices-hit-record-high-ahead-of-diwali-festivities/articleshow/114352916.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114352898,width-1200,height-630,imgsize-64642,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T12:53:02Z",
    "content": "Ahead of the Diwali-Dhanteras period, gold on Friday reached its historical high and crossed the Rs 77,000 per 10 gm mark in the physical market and was trading at Rs 77,332 per 10 gm, up from Rs 76,… [+1833 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Gold prices hit record high ahead of Diwali festivities Gold reached a historical high of Rs 77,332 per 10 gm on Friday, surpassing the Rs 77,000 mark. The market expectation is that by Diwali, prices will cross Rs 80,000 per 10 gm mark and may even touch Rs 85,000 per 10 gm level. With the Goods  Services Tax G Ahead of the Diwali-Dhanteras period, gold on Friday reached its historical high and crossed the Rs 77,000 per 10 gm mark in the physical market and was trading at Rs 77,332 per 10 gm, up from Rs 76,"
  },
  {
    "source": {
      "id": null,
      "name": "Securityaffairs.com"
    },
    "author": "Pierluigi Paganini",
    "title": "Two Sudanese nationals indicted for operating the Anonymous Sudan group",
    "description": "The DoJ charged Anonymous Sudan members and disrupted their DDoS infrastructure, halting its cyber operations. The US Justice Department charged two Sudanese brothers (Ahmed Salah Yousif Omer, 22, and Alaa Salah Yusuuf Omer, 27) with operating and controlling…",
    "url": "https://securityaffairs.com/169937/hacktivism/anonymous-sudan-members-arrested.html",
    "urlToImage": "https://securityaffairs.com/wp-content/uploads/2023/11/image-16.png",
    "publishedAt": "2024-10-18T00:01:04Z",
    "content": "Two Sudanese nationals indicted for operating the Anonymous Sudan group\r\n | Russia-linked RomCom group targeted Ukrainian government agencies since late 2023\r\n | A critical flaw in Kubernetes Image B… [+109582 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "The DoJ charged Anonymous Sudan members and disrupted their DDoS infrastructure, halting its cyber operations. The US Justice Department charged two Sudanese brothers Ahmed Salah Yousif Omer, 22, and Alaa Salah Yusuuf Omer, 27 with operating and controlling Two Sudanese nationals indicted for operating the Anonymous Sudan group  Russia-linked RomCom group targeted Ukrainian government agencies since late 2023  A critical flaw in Kubernetes Image B"
  },
  {
    "source": {
      "id": null,
      "name": "Irunfar.com"
    },
    "author": "Zach Miller",
    "title": "Growing Up",
    "description": "The post Growing Up appeared first on iRunFar.\nZach Miller's thoughts on the changes in trail running over the years, and the importance of maintaining its essence. \nGrowing Up by Zach Miller.",
    "url": "https://www.irunfar.com/growing-up",
    "urlToImage": "https://s3.amazonaws.com/www.irunfar.com/wp-content/uploads/2024/10/17034353/Zach-Miller-growing-up-training-feature.jpg",
    "publishedAt": "2024-10-18T10:00:54Z",
    "content": "A few days ago, I went for a run with Casey Campbell. I first met Casey when we competed on the same world championships team in Austria, he for the shorter stuff, I for the longer. Although we both … [+5122 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "The post Growing Up appeared first on iRunFar. Zach Millers thoughts on the changes in trail running over the years, and the importance of maintaining its essence. Growing Up by Zach Miller. A few days ago, I went for a run with Casey Campbell. I first met Casey when we competed on the same world championships team in Austria, he for the shorter stuff, I for the longer. Although we both"
  },
  {
    "source": {
      "id": null,
      "name": "BusinessLine"
    },
    "author": "BL Mumbai Bureau",
    "title": "RBI widens access to its NDS-OM electronic trading platform",
    "description": "RBI expands access to NDS-OM platform for regulated entities, provident funds, and pension funds, facilitating direct G-Secs trading.",
    "url": "https://www.thehindubusinessline.com/money-and-banking/rbi-widens-access-to-its-nds-om-electronic-trading-platform/article68769884.ece",
    "urlToImage": "https://bl-i.thgim.com/public/incoming/b47a8j/article68770015.ece/alternates/LANDSCAPE_1200/2024-06-27T101701Z_1715317836_RC2LJ8A2YYMN_RTRMADP_3_INDIA-CENBANK-REPORT.JPG",
    "publishedAt": "2024-10-18T15:27:48Z",
    "content": "The Reserve Bank of India has widened direct access to its Negotiated Dealing System-Order Matching (NDS-OM) electronic trading platform to a broader set of regulated entities (REs) including regiona… [+1565 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "RBI widens access to its NDS-OM electronic trading platform RBI expands access to NDS-OM platform for regulated entities, provident funds, and pension funds, facilitating direct G-Secs trading. The Reserve Bank of India has widened direct access to its Negotiated Dealing System-Order Matching NDS-OM electronic trading platform to a broader set of regulated entities REs including regiona"
  },
  {
    "source": {
      "id": null,
      "name": "TechSpot"
    },
    "author": "Steven Walton",
    "title": "Testing AMD's Zen 5 Performance Update: Ryzen 7 9700X, Windows 24H2, AGESA Update",
    "description": "AMD has worked hard to improve Zen 5 CPUs since their launch two months ago, but performance remains underwhelming. With BIOS updates, price cuts, and Windows optimizations, has Zen 5 finally improved? Let's find out.Read Entire Article",
    "url": "https://www.techspot.com/review/2906-amd-zen-5-performance-retest/",
    "urlToImage": "https://www.techspot.com/articles-info/2906/images/2024-10-15-image-3.jpg",
    "publishedAt": "2024-10-18T10:21:00Z",
    "content": "AMD has been working hard to boost sales of Zen 5 CPUs since their launch two months ago. After several generations of exciting Ryzen CPU launches, this one has been much more disappointing. Since Ze… [+10947 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Testing AMDs Zen 5 Performance Update Ryzen 7 9700X, Windows 24H2, AGESA Update AMD has worked hard to improve Zen 5 CPUs since their launch two months ago, but performance remains underwhelming. With BIOS updates, price cuts, and Windows optimizations, has Zen 5 finally improved? Lets find out.Read Entire Article AMD has been working hard to boost sales of Zen 5 CPUs since their launch two months ago. After several generations of exciting Ryzen CPU launches, this one has been much more disappointing. Since Ze"
  },
  {
    "source": {
      "id": "abc-news",
      "name": "ABC News"
    },
    "author": "The Associated Press",
    "title": "Egypt increases fuel prices by 10% to 17%",
    "description": "Egypt has raised fuel prices by between 10% and 17%, a move likely to impact the cost of both goods and services",
    "url": "https://abcnews.go.com/Business/wireStory/egypt-increases-fuel-prices-10-17-114920293",
    "urlToImage": "https://i.abcnewsfe.com/a/c2569d5a-9bac-42f6-93cb-dd2fdb779487/wirestory_2744cb224074a59b909060e798d9bbf6_16x9.jpg?w=1600",
    "publishedAt": "2024-10-18T10:46:27Z",
    "content": "CAIRO -- Egypt raised fuel prices Friday by between 10% and 17%, a move likely to impact the cost of both goods and services. \r\nThe Egyptian government said in a statement on Facebook that the decisi… [+1249 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Egypt increases fuel prices by 10 to 17 Egypt has raised fuel prices by between 10 and 17, a move likely to impact the cost of both goods and services CAIRO -- Egypt raised fuel prices Friday by between 10 and 17, a move likely to impact the cost of both goods and services. The Egyptian government said in a statement on Facebook that the decisi"
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "RAMSAY SANTE",
    "title": "RAMSAY SANTE :Annual results at the end of June 2024",
    "description": "PRESS RELEASE                  Paris, 18th October 2024  Annual results at the end of June 2024  As a mission-driven company, Ramsay Santé, thanks to...",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965650/0/en/RAMSAY-SANTE-Annual-results-at-the-end-of-June-2024.html",
    "urlToImage": "https://ml-eu.globenewswire.com/Resource/Download/181af581-c6e4-4fc4-82bf-479daac7ff1f",
    "publishedAt": "2024-10-18T15:35:00Z",
    "content": "PRESS RELEASE\r\n                Paris, 18th October 2024\r\nAnnual results at the end of June 2024\r\nAs a mission-driven company, Ramsay Santé, thanks to its employees and medical community, is committed… [+48394 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "RAMSAY SANTE Annual results at the end of June 2024 PRESS RELEASE Paris, 18th October 2024 Annual results at the end of June 2024 As a mission-driven company, Ramsay Santé, thanks to... PRESS RELEASE Paris, 18th October 2024 Annual results at the end of June 2024 As a mission-driven company, Ramsay Santé, thanks to its employees and medical community, is committed"
  },
  {
    "source": {
      "id": null,
      "name": "newsBTC"
    },
    "author": "Christian Encila",
    "title": "Analysts On Bitcoin: 2024 US Election Could Steer The Crypto’s Future",
    "description": "Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will take their toll on the cryptocurrency in the near future with…",
    "url": "http://www.newsbtc.com/news/qcp-capital-on-bitcoin-2024-us-election-could-steer-the-cryptos-future/",
    "urlToImage": "https://www.newsbtc.com/wp-content/uploads/2024/10/A_ef5b98.png?fit=2048%2C1152",
    "publishedAt": "2024-10-18T07:00:10Z",
    "content": "Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will t… [+3138 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Analysts On Bitcoin 2024 US Election Could Steer The Cryptos Future Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will take their toll on the cryptocurrency in the near future with Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will t"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "Reuters",
    "title": "Japan's Nikkei ends marginally higher, profit-booking pares gains",
    "description": "The Nikkei added 0.18% to close at 38,981.75, after rising as much as 0.7% earlier in the session. The index ended the week 1.75% lower.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-marginally-higher-profit-booking-pares-gains/articleshow/114342845.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114342889,width-1200,height-630,imgsize-168278,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T07:38:50Z",
    "content": "Japan's Nikkei share average ended higher on Friday, tracking the Dow's overnight gains, but pared a large chunk of its early gains as investors booked profits.The Nikkei added 0.18% to close at 38,9… [+1796 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Japans Nikkei ends marginally higher, profit-booking pares gains The Nikkei added 0.18 to close at 38,981.75, after rising as much as 0.7 earlier in the session. The index ended the week 1.75 lower. Japans Nikkei share average ended higher on Friday, tracking the Dows overnight gains, but pared a large chunk of its early gains as investors booked profits.The Nikkei added 0.18 to close at 38,9"
  },
  {
    "source": {
      "id": null,
      "name": "[Removed]"
    },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-18T10:30:00Z",
    "content": "[Removed]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Removed"
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "Tarkett",
    "title": "Q3 2024 Revenue: Solid organic sales growth of +2.4% Sports division grew at a sustained pace in the most important quarter of the year. Activity remained sluggish in flooring, particularly in EMEA and the CIS countries",
    "description": "Q3 2024 Revenue:    Solid organic sales growth of +2.4%    Sports division grew at a sustained pace in the most...",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965339/0/en/Q3-2024-Revenue-Solid-organic-sales-growth-of-2-4-Sports-division-grew-at-a-sustained-pace-in-the-most-important-quarter-of-the-year-Activity-remained-sluggish-in-flooring-particul.html",
    "urlToImage": "https://ml-eu.globenewswire.com/Resource/Download/a54580e9-6cbb-4455-85d2-447b1d3dce35",
    "publishedAt": "2024-10-18T06:01:00Z",
    "content": "Q3 2024 Revenue:\r\nSolid organic sales growth of +2.4%\r\nSports division grew at a sustained pace in the most important quarter of the year\r\nActivity remained sluggish in flooring, particularly in EMEA… [+13447 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Q3 2024 Revenue Solid organic sales growth of 2.4 Sports division grew at a sustained pace in the most important quarter of the year. Activity remained sluggish in flooring, particularly in EMEA and the CIS countries Q3 2024 Revenue Solid organic sales growth of 2.4 Sports division grew at a sustained pace in the most... Q3 2024 Revenue Solid organic sales growth of 2.4 Sports division grew at a sustained pace in the most important quarter of the year Activity remained sluggish in flooring, particularly in EMEA"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Erica Yokoyama",
    "title": "Japan Union to Call for Continued Wage Growth of 5% or More",
    "description": "(Bloomberg) -- Japan’s largest labor union federation aims to secure wage increases averaging at least 5% in next year’s pay negotiations, in a bid to...",
    "url": "https://www.yahoo.com/news/japan-union-call-continued-wage-061457986.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/CjrPjZ_zGdTGws2Jqc2qqA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02ODc-/https://media.zenfs.com/en/bloomberg_politics_602/1c3e33e2d40f531d9c56af9e100483cd",
    "publishedAt": "2024-10-18T06:14:57Z",
    "content": "(Bloomberg) -- Japans largest labor union federation aims to secure wage increases averaging at least 5% in next years pay negotiations, in a bid to maintain momentum after major gains this year, acc… [+5102 chars]",
    "categories": [
      "Monetary Policy",
      "Market Sentiment"
    ],
    "full_description": "Japan Union to Call for Continued Wage Growth of 5 or More Bloomberg -- Japans largest labor union federation aims to secure wage increases averaging at least 5 in next years pay negotiations, in a bid to... Bloomberg -- Japans largest labor union federation aims to secure wage increases averaging at least 5 in next years pay negotiations, in a bid to maintain momentum after major gains this year, acc"
  },
  {
    "source": {
      "id": null,
      "name": "Crypto Briefing"
    },
    "author": "Estefano Gomez",
    "title": "Putin confirms BRICS will explore digital currencies for investment development",
    "description": "Putin confirms BRICS will discuss using digital currencies to foster investment and reduce US dollar reliance.\nThe post Putin confirms BRICS will explore digital currencies for investment development appeared first on Crypto Briefing.",
    "url": "https://cryptobriefing.com/brics-digital-currencies-discussion/",
    "urlToImage": "https://static.cryptobriefing.com/wp-content/uploads/2024/08/07080805/Putin-Russia-2-800x420.jpg",
    "publishedAt": "2024-10-18T16:28:25Z",
    "content": "Key Takeaways\r\n<ul><li>BRICS discusses digital currencies to reduce US dollar dependency.</li><li>New BRICS Pay platform introduced to enhance cross-border transactions.</li></ul>\r\nShare this article… [+1368 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Putin confirms BRICS will discuss using digital currencies to foster investment and reduce US dollar reliance. The post Putin confirms BRICS will explore digital currencies for investment development appeared first on Crypto Briefing. Key Takeaways BRICS discusses digital currencies to reduce US dollar dependency.New BRICS Pay platform introduced to enhance cross-border transactions. Share this article"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "PT Bank Rakyat Indonesia (Persero) Tbk (OTCMKTS:BKRKF) Trading 3.8% Higher – Here’s Why",
    "description": "PT Bank Rakyat Indonesia (Persero) Tbk (OTCMKTS:BKRKF – Get Free Report)’s share price traded up 3.8% during trading on Thursday . The company traded as high as $0.32 and last traded at $0.29. 7,370 shares changed hands during mid-day trading, a decline of 92…",
    "url": "https://www.etfdailynews.com/2024/10/18/pt-bank-rakyat-indonesia-persero-tbk-otcmktsbkrkf-trading-3-8-higher-heres-why/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/pt-bank-rakyat-indonesia-(persero)-tbk-logo-1200x675.png&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T06:22:53Z",
    "content": "PT Bank Rakyat Indonesia (Persero) Tbk (OTCMKTS:BKRKF – Get Free Report)’s share price traded up 3.8% during trading on Thursday . The company traded as high as $0.32 and last traded at $0.29. 7,370 … [+1106 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "PT Bank Rakyat Indonesia Persero Tbk OTCMKTSBKRKF Trading 3.8 Higher  Heres Why PT Bank Rakyat Indonesia Persero Tbk OTCMKTSBKRKF  Get Free Reports share price traded up 3.8 during trading on Thursday . The company traded as high as 0.32 and last traded at 0.29. 7,370 shares changed hands during mid-day trading, a decline of 92 PT Bank Rakyat Indonesia Persero Tbk OTCMKTSBKRKF  Get Free Reports share price traded up 3.8 during trading on Thursday . The company traded as high as 0.32 and last traded at 0.29. 7,370"
  },
  {
    "source": {
      "id": null,
      "name": "BusinessLine"
    },
    "author": "BL Mumbai Bureau",
    "title": "India’s forex reserves dip below $700 billion after staying above that level for two weeks",
    "description": "India's foreign exchange reserves fall below $700 billion due to revaluation losses and RBI intervention, impacting various components.",
    "url": "https://www.thehindubusinessline.com/markets/forex/indias-forex-reserves-dip-below-700-billion-after-staying-above-that-level-for-two-weeks/article68769978.ece",
    "urlToImage": "https://bl-i.thgim.com/public/incoming/9ocdvw/article68765959.ece/alternates/LANDSCAPE_1200/IMG_FILE_PHOTO__Euro__Ho_2_1_PPCJMJ46.jpg",
    "publishedAt": "2024-10-18T15:26:53Z",
    "content": "Indias foreign exchange reserves dipped below the $700 billion mark in the week ended October 11th after staying above this level in the preceding two weeks.\r\nThe reserves shrunk by $10.746 billion d… [+830 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Indias forex reserves dip below 700 billion after staying above that level for two weeks Indias foreign exchange reserves fall below 700 billion due to revaluation losses and RBI intervention, impacting various components. Indias foreign exchange reserves dipped below the 700 billion mark in the week ended October 11th after staying above this level in the preceding two weeks. The reserves shrunk by 10.746 billion d"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Dollar buoyant, equities cautious ahead of China data",
    "description": "Dollar buoyant, equities cautious ahead of China data",
    "url": "https://www.investing.com/news/stock-market-news/dollar-buoyant-equities-cautious-ahead-of-china-data-3670054",
    "urlToImage": "https://i-invdn-com.investing.com/news/LYNXNPEBAG0BO_L.jpg",
    "publishedAt": "2024-10-18T01:40:36Z",
    "content": "By Kevin Buckland\r\nTOKYO (Reuters) - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing… [+3330 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Dollar buoyant, equities cautious ahead of China data By Kevin Buckland TOKYO Reuters - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Investing.com",
    "title": "Asia FX muted as dollar steadies at over 2-mth peaks on strong data",
    "description": "Asia FX muted as dollar steadies at over 2-mth peaks on strong data",
    "url": "https://www.investing.com/news/forex-news/asia-fx-muted-as-dollar-steadies-at-over-2mth-peaks-on-strong-data-3670093",
    "urlToImage": "https://i-invdn-com.investing.com/news/moved_LYNXMPEI7N017_L.jpg",
    "publishedAt": "2024-10-18T04:16:17Z",
    "content": "Investing.com-- Most Asian currencies kept to a tight range on Friday as the dollar steadied at more than two-month highs as strong economic data furthered expectations of smaller interest rate cuts.… [+2624 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Asia FX muted as dollar steadies at over 2-mth peaks on strong data Investing.com-- Most Asian currencies kept to a tight range on Friday as the dollar steadied at more than two-month highs as strong economic data furthered expectations of smaller interest rate cuts."
  },
  {
    "source": {
      "id": null,
      "name": "The Daily Hodl"
    },
    "author": "Vitaliy Shtyrkin",
    "title": "The Power of Stablecoins – Boosting E-Commerce Payments and Opening Doors for Retailers in Crypto",
    "description": "Stablecoins are already becoming a mainstream digital tool for everyday use. Now, both companies and regular users utilize them for payments. In Singapore, for example, the stablecoin payment value reached $1 billion a few weeks ago, once again proving that t…",
    "url": "https://dailyhodl.com/2024/10/17/the-power-of-stablecoins-boosting-e-commerce-payments-and-opening-doors-for-retailers-in-crypto/",
    "urlToImage": "https://dailyhodl.com/wp-content/uploads/2024/01/2024-With-Altcoins-Outshining.jpg",
    "publishedAt": "2024-10-18T03:40:19Z",
    "content": "Stablecoins are already becoming a mainstream digital tool for everyday use. Now, both companies and regular users utilize them for payments.\r\nIn Singapore, for example, the stablecoin payment value … [+6168 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "The Power of Stablecoins  Boosting E-Commerce Payments and Opening Doors for Retailers in Crypto Stablecoins are already becoming a mainstream digital tool for everyday use. Now, both companies and regular users utilize them for payments. In Singapore, for example, the stablecoin payment value reached 1 billion a few weeks ago, once again proving that t Stablecoins are already becoming a mainstream digital tool for everyday use. Now, both companies and regular users utilize them for payments. In Singapore, for example, the stablecoin payment value"
  },
  {
    "source": {
      "id": null,
      "name": "New York Post"
    },
    "author": "A.G. Gancarski",
    "title": "Trump leads Arizona as voters riddled with economic anxiety",
    "description": "New polling from CBS News and YouGov shows Donald Trump is on his way to picking up 11 electoral votes, with Arizona voters sour on the national direction and riddled with economic anxiety. The survey of 1,439 registered voters shows the former president ahea…",
    "url": "https://nypost.com/2024/10/17/us-news/trump-leads-arizona-as-voters-riddled-with-economic-anxiety/",
    "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/10/2177574986-e1728933219772.jpg?quality=75&strip=all&w=1024",
    "publishedAt": "2024-10-18T02:02:45Z",
    "content": "New polling from CBS News and YouGov shows Donald Trump is on his way to picking up 11 electoral votes, with Arizona voters sour on the national direction and riddled with economic anxiety.\r\nThe surv… [+2786 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "Trump leads Arizona as voters riddled with economic anxiety New polling from CBS News and YouGov shows Donald Trump is on his way to picking up 11 electoral votes, with Arizona voters sour on the national direction and riddled with economic anxiety. The survey of 1,439 registered voters shows the former president ahea New polling from CBS News and YouGov shows Donald Trump is on his way to picking up 11 electoral votes, with Arizona voters sour on the national direction and riddled with economic anxiety. The surv"
  },
  {
    "source": {
      "id": null,
      "name": "Rappler"
    },
    "author": "Mon Abrea",
    "title": "[Ask The Tax Whiz] Accounting and tax treatment for Foreign Currency Transactions",
    "description": "The Philippine Tax Whiz explains the recently issued RMC 12-2024 which aims to clarify the foreign exchange transactions for Financial Reporting and Internal Revenue Tax Purposes",
    "url": "https://www.rappler.com/business/ask-the-tax-whiz-accounting-treatment-foreign-currency-transactions/",
    "urlToImage": "https://www.rappler.com/tachyon/2022/11/tax-papers-hand-shutterstock.jpg",
    "publishedAt": "2024-10-18T05:57:13Z",
    "content": "Foreign currency transactions are converted into functional currency³ using the spot rate at the transaction time, with taxpayers consistently applying their chosen rate (e.g. open, close, high, low,… [+1982 chars]",
    "categories": [
      "Economic Indicators",
      "Currency Specific"
    ],
    "full_description": "Ask The Tax Whiz Accounting and tax treatment for Foreign Currency Transactions The Philippine Tax Whiz explains the recently issued RMC 12-2024 which aims to clarify the foreign exchange transactions for Financial Reporting and Internal Revenue Tax Purposes Foreign currency transactions are converted into functional currency³ using the spot rate at the transaction time, with taxpayers consistently applying their chosen rate e.g. open, close, high, low,"
  },
  {
    "source": {
      "id": null,
      "name": "BusinessLine"
    },
    "author": "Aroosa Ahmed",
    "title": "TCP profit surges, clocks ₹4,214 crore revenue",
    "description": "Tata Consumer Products Limited reports 7.69% increase in net profit, strong growth in India salt, tea, and international business.",
    "url": "https://www.thehindubusinessline.com/companies/tcp-profit-surges-clocks-4214-crore-revenue/article68768961.ece",
    "urlToImage": "https://bl-i.thgim.com/public/incoming/sjcqm4/article68769177.ece/alternates/LANDSCAPE_1200/IMG_BL05_Tata_consumer_p_2_1_44CG9L2U.jpg",
    "publishedAt": "2024-10-18T13:21:03Z",
    "content": "<table><tr><th></th><th>September 2024</th><th>September 2023</th><th>Change </th></tr><tr><td>Profit/Loss </td><td>Rs. 364 crore </td><td>Rs. 338 crore </td><td>7.69%</td></tr><tr><td>Revenue </td><… [+2959 chars]",
    "categories": [
      "Uncategorized"
    ],
    "full_description": "TCP profit surges, clocks 4,214 crore revenue Tata Consumer Products Limited reports 7.69 increase in net profit, strong growth in India salt, tea, and international business. September 2024September 2023Change ProfitLoss Rs. 364 crore Rs. 338 crore 7.69Revenue"
  }
]