[
  {
    "source": {
      "id": null,
      "name": "PC Gamer"
    },
    "author": "Mollie Taylor",
    "title": "'We apologize for not meeting the community's expectations:' Tekken 8 makes a rare acknowledgement of fan backlash after failing to include a $5 stage in its season pass",
    "description": "It's giving people free currency and pass holders the next stage as an apology.",
    "url": "https://www.pcgamer.com/games/fighting/we-apologize-for-not-meeting-the-communitys-expectations-tekken-8-makes-a-rare-acknowledgement-of-fan-backlash-after-failing-to-include-a-usd5-stage-in-its-season-pass/",
    "urlToImage": "https://cdn.mos.cms.futurecdn.net/FikVoAE9Sx6vwsCrUgr94k-1200-80.jpg",
    "publishedAt": "2024-10-18T11:16:09Z",
    "content": "Tekken 8's monetisation model has been landing Bandai Namco in hot water for a good chunk of this year. Sneaky cash shop introductions first drew fan ire back in February, with the more recent critic… [+2277 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "We apologize for not meeting the communitys expectations Tekken 8 makes a rare acknowledgement of fan backlash after failing to include a 5 stage in its season pass Its giving people free currency and pass holders the next stage as an apology. Tekken 8s monetisation model has been landing Bandai Namco in hot water for a good chunk of this year. Sneaky cash shop introductions first drew fan ire back in February, with the more recent critic"
  },
  {
    "source": {
      "id": null,
      "name": "The New Yorker"
    },
    "author": "Susan B. Glasser",
    "title": "How Republican Billionaires Learned to Love Trump Again",
    "description": "The former President has successfully won over wealthy figures including Elon Musk, Nelson Peltz, Steve Wynn, Miriam Adelson, José (Pepe) Fanjul, Stephen Schwarzman, Timothy Mellon, and David Sacks. Susan Glasser reports.",
    "url": "https://www.newyorker.com/magazine/2024/10/28/how-republican-billionaires-learned-to-love-trump-again",
    "urlToImage": "https://media.newyorker.com/photos/670edd65cc86526c297a48b0/16:9/w_1280,c_limit/r45135.jpg",
    "publishedAt": "2024-10-18T10:00:00Z",
    "content": "The reason is structural: Democrats have retained an advantage in small online donations, while Republicans rely on a higher percentage of large contributions. As of late September, sixty-eight per c… [+11787 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "How Republican Billionaires Learned to Love Trump Again The former President has successfully won over wealthy figures including Elon Musk, Nelson Peltz, Steve Wynn, Miriam Adelson, José Pepe Fanjul, Stephen Schwarzman, Timothy Mellon, and David Sacks. Susan Glasser reports. The reason is structural Democrats have retained an advantage in small online donations, while Republicans rely on a higher percentage of large contributions. As of late September, sixty-eight per c"
  },
  {
    "source": {
      "id": null,
      "name": "Europa.eu"
    },
    "author": "European Central Bank",
    "title": "Results of the September 2024 Survey on credit terms and conditions in euro-denominated securities financing and over-the-counter derivatives markets (SESFOD)",
    "description": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "url": "https://www.ecb.europa.eu/press/pr/date/2024/html/ecb.pr241018~06adb02edb.en.html",
    "urlToImage": "https://www.ecb.europa.eu/press/shared/img/socialmedia/social-default.jpg?0ef1632c35edede913681bb76af694a4",
    "publishedAt": "2024-10-18T07:00:00Z",
    "content": "18 October 2024\r\n<ul><li>Overall credit terms and conditions eased somewhat between June 2024 and August 2024 on account of improved general market liquidity</li><li>Increase in demand for funding se… [+4273 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Results of the September 2024 Survey on credit terms and conditions in euro-denominated securities financing and over-the-counter derivatives markets SESFOD The European Central Bank ECB is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency. 18 October 2024 Overall credit terms and conditions eased somewhat between June 2024 and August 2024 on account of improved general market liquidityIncrease in demand for funding se"
  },
  {
    "source": {
      "id": null,
      "name": "Biztoc.com"
    },
    "author": "asia.nikkei.com",
    "title": "Japan's top currency diplomat says recent yen moves are 'one-sided'",
    "description": "Japan's top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are \"somewhat one-sided and rapid,\" in a fresh warning against speculative trading as the yen fell past the key 150 line against the dollar.\n\"We as Japanese authorities a…",
    "url": "https://biztoc.com/x/facfcf8117d60341",
    "urlToImage": "https://biztoc.com/cdn/facfcf8117d60341_s.webp",
    "publishedAt": "2024-10-18T04:33:42Z",
    "content": "Japan's top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are \"somewhat one-sided and rapid,\" in a fresh warning against speculative trading as the yen fell past the ke… [+154 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Japans top currency diplomat says recent yen moves are one-sided Japans top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are somewhat one-sided and rapid, in a fresh warning against speculative trading as the yen fell past the key 150 line against the dollar. We as Japanese authorities a Japans top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are somewhat one-sided and rapid, in a fresh warning against speculative trading as the yen fell past the ke"
  },
  {
    "source": {
      "id": null,
      "name": "The Punch"
    },
    "author": "Tunde Odesola",
    "title": "Pasuma, Currency and Super Eagles’ humiliation (1)",
    "description": "Indeed and in deed, I’m not envious of the T-Pain nickname of President Bola Tinubu because I’m T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President is forcing down the throats of Nigerians. My T-P, Tunde-Par…",
    "url": "https://punchng.com/pasuma-currency-and-super-eagles-humiliation-1/",
    "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2023/02/17072659/Tunde-Odesola-.jpg",
    "publishedAt": "2024-10-18T00:36:16Z",
    "content": "Indeed and in deed, Im not envious of the T-Pain nickname of President Bola Tinubu because Im T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President i… [+7611 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Pasuma, Currency and Super Eagles humiliation 1 Indeed and in deed, Im not envious of the T-Pain nickname of President Bola Tinubu because Im T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President is forcing down the throats of Nigerians. My T-P, Tunde-Par Indeed and in deed, Im not envious of the T-Pain nickname of President Bola Tinubu because Im T-P, too. But my T-P is not Tunde-Pain. Neither is it the weight loss Tinubu-Pain capsule the President i"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ET Online",
    "title": "India's forex reserves fall by $10.7 billion",
    "description": "India's forex reserves contracted by $10.7 billion to $690 billion as of October 11, with foreign currency assets reducing by $10.5 billion to $602 billion. Gold reserves and SDRs also saw a dip, while the RBI continues managing market volatility to prevent s…",
    "url": "https://economictimes.indiatimes.com/news/economy/indicators/indias-forex-reserves-fall-by-10-7-billion/articleshow/114339941.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114339970,width-1200,height-630,imgsize-93140,overlay-economictimes/articleshow.jpg",
    "publishedAt": "2024-10-18T11:40:23Z",
    "content": "Artificial Intelligence(AI)\r\nAI and Analytics based Business Strategy\r\nBy - Tanusree De, Managing Director- Accenture Technology Lead, Trustworthy AI Center of Excellence: ATCI\r\nView Program",
    "categories": [
      "Currency Specific",
      "Market Sentiment"
    ],
    "full_description": "Indias forex reserves fall by 10.7 billion Indias forex reserves contracted by 10.7 billion to 690 billion as of October 11, with foreign currency assets reducing by 10.5 billion to 602 billion. Gold reserves and SDRs also saw a dip, while the RBI continues managing market volatility to prevent s Artificial IntelligenceAI AI and Analytics based Business Strategy By - Tanusree De, Managing Director- Accenture Technology Lead, Trustworthy AI Center of Excellence ATCI View Program"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Japan top FX diplomat says recent yen moves \"one-sided\" in fresh warning",
    "description": "Japan top FX diplomat says recent yen moves \"one-sided\" in fresh warning",
    "url": "https://www.investing.com/news/economy-news/japan-top-fx-diplomat-says-recent-yen-moves-onesided-in-fresh-warning-3670039",
    "urlToImage": "https://i-invdn-com.investing.com/news/indicatornews_3_800x533_L_1412601605.jpg",
    "publishedAt": "2024-10-18T00:41:11Z",
    "content": "By Makiko Yamazaki\r\nTOKYO (Reuters) - Japan's top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are \"somewhat one-sided and rapid,\" in a fresh warning against speculati… [+487 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Japan top FX diplomat says recent yen moves one-sided in fresh warning By Makiko Yamazaki TOKYO Reuters - Japans top currency diplomat, Atsushi Mimura, said on Friday that recent currency moves are somewhat one-sided and rapid, in a fresh warning against speculati"
  },
  {
    "source": {
      "id": null,
      "name": "Europa.eu"
    },
    "author": "European Central Bank",
    "title": "Results of the ECB Survey of Professional Forecasters for the fourth quarter of 2024",
    "description": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "url": "https://www.ecb.europa.eu//press/pr/date/2024/html/ecb.pr241018_1~9b5ce6a9bf.en.html",
    "urlToImage": "https://www.ecb.europa.eu/press/shared/img/socialmedia/social-default.jpg?0ef1632c35edede913681bb76af694a4",
    "publishedAt": "2024-10-18T08:00:00Z",
    "content": "18 October 2024\r\n<ul><li>Inflation expectations at 2.4% for 2024 and 1.9% for 2025 and 2026; unchanged except for 0.1 percentage point downward revision for 2025; longer-term inflation expectations (… [+1674 chars]",
    "categories": [
      "Monetary Policy",
      "Economic Indicators",
      "Currency Specific",
      "Market Sentiment",
      "Geopolitical"
    ],
    "full_description": "Results of the ECB Survey of Professional Forecasters for the fourth quarter of 2024 The European Central Bank ECB is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency. 18 October 2024 Inflation expectations at 2.4 for 2024 and 1.9 for 2025 and 2026 unchanged except for 0.1 percentage point downward revision for 2025 longer-term inflation expectations"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Kevin Buckland",
    "title": "Dollar buoyant, equities cautious ahead of China data",
    "description": "The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve...",
    "url": "https://finance.yahoo.com/news/dollar-buoyant-equities-cautious-ahead-013640653.html",
    "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/84f28d4a7f2fce92bc9f00ba325ededb",
    "publishedAt": "2024-10-18T01:36:40Z",
    "content": "By Kevin Buckland\r\nTOKYO (Reuters) - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing… [+3375 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Dollar buoyant, equities cautious ahead of China data The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve... By Kevin Buckland TOKYO Reuters - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing"
  },
  {
    "source": {
      "id": null,
      "name": "BusinessLine"
    },
    "author": "PTI",
    "title": "Rupee slips 1 paisa to 84.07 against US dollar in early trade",
    "description": "Rupee weakens against US dollar amid negative equity markets, higher crude oil prices, and outflow of foreign funds.",
    "url": "https://www.thehindubusinessline.com/markets/forex/rupee-slips-1-paisa-to-8407-against-us-dollar-in-early-trade/article68767728.ece",
    "urlToImage": "https://bl-i.thgim.com/public/todays-paper/tp-news/4skt72/article68734295.ece/alternates/LANDSCAPE_1200/Weekly-Rupee-ViGBIDEC2FD.5.jpg.jpg",
    "publishedAt": "2024-10-18T04:22:27Z",
    "content": "The rupee slipped 1 paisa to 84.07 against the US dollar in early trade on Friday, as the weakening American currency failed to support the local unit amid negative domestic equity markets and higher… [+1222 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Rupee slips 1 paisa to 84.07 against US dollar in early trade Rupee weakens against US dollar amid negative equity markets, higher crude oil prices, and outflow of foreign funds. The rupee slipped 1 paisa to 84.07 against the US dollar in early trade on Friday, as the weakening American currency failed to support the local unit amid negative domestic equity markets and higher"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "AFP",
    "title": "Japan's core inflation rate slows in September",
    "description": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.Excluding both...",
    "url": "https://finance.yahoo.com/news/japans-core-inflation-rate-slows-001922025.html",
    "urlToImage": "https://media.zenfs.com/en/afp.com/02f61df4e6fa6053776277edabc64560",
    "publishedAt": "2024-10-18T00:19:22Z",
    "content": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.\r\nThe core Consumer Price Index eased from 2.8 percent in Aug… [+1775 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Japans core inflation rate slows in September Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.Excluding both... Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in Aug"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "First Trust Emerging Markets Local Currency Bond ETF (NASDAQ:FEMB) Shares Sold by Concourse Financial Group Securities Inc.",
    "description": "Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF (NASDAQ:FEMB – Free Report) by 6.2% during the third quarter, according to its most recent Form 13F filing with the Securities & E…",
    "url": "https://www.etfdailynews.com/2024/10/18/first-trust-emerging-markets-local-currency-bond-etf-nasdaqfemb-shares-sold-by-concourse-financial-group-securities-inc/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/first-trust-emerging-markets-local-currency-bond-etf-logo-1200x675.jpg?v=20230405063350&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T10:24:38Z",
    "content": "Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF (NASDAQ:FEMB – Free Report) by 6.2% during the third quarter, accordin… [+2944 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "First Trust Emerging Markets Local Currency Bond ETF NASDAQFEMB Shares Sold by Concourse Financial Group Securities Inc. Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF NASDAQFEMB  Free Report by 6.2 during the third quarter, according to its most recent Form 13F filing with the Securities  E Concourse Financial Group Securities Inc. trimmed its position in shares of First Trust Emerging Markets Local Currency Bond ETF NASDAQFEMB  Free Report by 6.2 during the third quarter, accordin"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "GuruFocus News",
    "title": "Decoding Snap-on Inc (SNA): A Strategic SWOT Insight",
    "description": "Insightful Analysis of Snap-on Inc's Financial Health and Strategic Position",
    "url": "https://finance.yahoo.com/news/decoding-snap-inc-sna-strategic-050649157.html",
    "urlToImage": "https://media.zenfs.com/en/us.finance.gurufocus/a1d2166b412e2dda3de8784868ff22ac",
    "publishedAt": "2024-10-18T05:06:49Z",
    "content": "<ul><li>Strengths: Robust brand reputation and innovative product offerings drive customer loyalty and market dominance.\r\n</li><li>Weaknesses: The franchisee-dependent model introduces risks related … [+6211 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Decoding Snap-on Inc SNA A Strategic SWOT Insight Insightful Analysis of Snap-on Incs Financial Health and Strategic Position Strengths Robust brand reputation and innovative product offerings drive customer loyalty and market dominance. Weaknesses The franchisee-dependent model introduces risks related"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Kevin Buckland",
    "title": "Morning Bid: Lots of China news, little clarity",
    "description": "China is very much the center of attention today, following a barrage of data and remarks from its central bank chief, financial regulator and stats bureau...",
    "url": "https://finance.yahoo.com/news/morning-bid-lots-china-news-043425118.html",
    "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/aca6d555a95e01819c7d49f9c3ee6733",
    "publishedAt": "2024-10-18T04:34:25Z",
    "content": "By Kevin Buckland\r\nA look at the day ahead in European and global markets from Kevin Buckland\r\nChina is very much the center of attention today, following a barrage of data and remarks from its centr… [+1965 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Morning Bid Lots of China news, little clarity China is very much the center of attention today, following a barrage of data and remarks from its central bank chief, financial regulator and stats bureau... By Kevin Buckland A look at the day ahead in European and global markets from Kevin Buckland China is very much the center of attention today, following a barrage of data and remarks from its centr"
  },
  {
    "source": {
      "id": null,
      "name": "Eurogamer.net"
    },
    "author": "Will Judd",
    "title": "Diablo 4: Vessel of Hatred review - a spirited expansion pack in the classic Blizzard style",
    "description": "I miss expansion packs. Blizzard in particular was famous for what we'd now call \"post-launch DLC\", updating the likes of StarCraft, Warcraft and Diablo with incredible upgrades that extended beloved storylines while adding on much-needed polish and complexit…",
    "url": "https://www.eurogamer.net/diablo-4-vessel-of-hatred-review",
    "urlToImage": "https://assetsio.gnwcdn.com/diablo-4-vessel-of-hatred-review-header.png?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "publishedAt": "2024-10-18T09:35:31Z",
    "content": "A polished, bewitching upgrade that sinks its claws into you - featuring perhaps the best character class in Diablo's history. \r\nI miss expansion packs. Blizzard in particular was famous for what we'… [+9376 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Diablo 4 Vessel of Hatred review - a spirited expansion pack in the classic Blizzard style I miss expansion packs. Blizzard in particular was famous for what wed now call post-launch DLC, updating the likes of StarCraft, Warcraft and Diablo with incredible upgrades that extended beloved storylines while adding on much-needed polish and complexit A polished, bewitching upgrade that sinks its claws into you - featuring perhaps the best character class in Diablos history. I miss expansion packs. Blizzard in particular was famous for what we"
  },
  {
    "source": {
      "id": null,
      "name": "Ozbargain.com.au"
    },
    "author": "Hiphopopotamus",
    "title": "Booking.com: 10% Cashback on Eligible Accommodation Bookings + $10 Bonus Cashback on $100 Spend @ Cashrewards",
    "description": "If you're making a larger booking SB has 12% cashback, ends tonight.\n\n\n DISCOUNT\n $10 bonus when you make a Booking of $100 or more\n Expires: Oct 19, 2024, 9:59:00 AM\r\n\n\n\nSpecial terms\n\nImportant: Ensure \"In Partnership with Cashrewards\" or \"Cashrewards\" bran…",
    "url": "https://www.ozbargain.com.au/node/872179",
    "urlToImage": "https://files.ozbargain.com.au/n/79/872179x.jpg?h=6d3c598a",
    "publishedAt": "2024-10-18T05:52:45Z",
    "content": "If you're making a larger booking SB has 12% cashback, ends tonight.\r\nDISCOUNT$10 bonus when you make a Booking of $100 or moreExpires: Oct 19, 2024, 9:59:00 AM\r\nSpecial terms\r\nImportant: Ensure \"In … [+1704 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Booking.com 10 Cashback on Eligible Accommodation Bookings  10 Bonus Cashback on 100 Spend  Cashrewards If youre making a larger booking SB has 12 cashback, ends tonight. DISCOUNT 10 bonus when you make a Booking of 100 or more Expires Oct 19, 2024, 95900 AM Special terms Important Ensure In Partnership with Cashrewards or Cashrewards bran If youre making a larger booking SB has 12 cashback, ends tonight. DISCOUNT10 bonus when you make a Booking of 100 or moreExpires Oct 19, 2024, 95900 AM Special terms Important Ensure In"
  },
  {
    "source": {
      "id": null,
      "name": "The Diplomat"
    },
    "author": "Sebastian Strangio",
    "title": "Vietnam Sentences Businesswoman to Life in Prison in Mega-Fraud Trial",
    "description": "Truong My Lan, 68, is already on death row for masterminding the embezzlement of $26.8 billion from Saigon Commercial Bank.",
    "url": "https://thediplomat.com/2024/10/vietnam-sentences-businesswoman-to-life-in-prison-in-mega-fraud-trial/",
    "urlToImage": "https://thediplomat.com/wp-content/uploads/2024/10/sizes/td-story-s-2/thediplomat_2024-10-18-003356.jpg",
    "publishedAt": "2024-10-18T04:30:35Z",
    "content": "Businesswoman Truong My Lan was sentenced to life in prison yesterday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported.\r\nIn a heari… [+6558 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Vietnam Sentences Businesswoman to Life in Prison in Mega-Fraud Trial Truong My Lan, 68, is already on death row for masterminding the embezzlement of 26.8 billion from Saigon Commercial Bank. Businesswoman Truong My Lan was sentenced to life in prison yesterday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported. In a heari"
  },
  {
    "source": {
      "id": null,
      "name": "International Business Times"
    },
    "author": "AFP News",
    "title": "Japan's Core Inflation Rate Slows In September",
    "description": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.",
    "url": "https://www.ibtimes.com/japans-core-inflation-rate-slows-september-3747160",
    "urlToImage": "https://d.ibtimes.com/en/full/4554976/japanese-inflation-has-been-above-central-banks-two-percent-target-since-april-2022.jpg",
    "publishedAt": "2024-10-18T03:47:45Z",
    "content": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.\r\nThe core Consumer Price Index eased from 2.8 percent in Aug… [+1763 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Japans Core Inflation Rate Slows In September Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in Aug"
  },
  {
    "source": {
      "id": null,
      "name": "Japan Today"
    },
    "author": null,
    "title": "Japan's core inflation rate slows in September",
    "description": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in August as the pace of increase in electricity and gas prices rel…",
    "url": "https://japantoday.com/category/business/japan%27s-core-inflation-rate-slows-in-september",
    "urlToImage": null,
    "publishedAt": "2024-10-18T07:35:12Z",
    "content": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday.\r\nThe core Consumer Price Index eased from 2.8 percent in Aug… [+1773 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Japans core inflation rate slows in September Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in August as the pace of increase in electricity and gas prices rel Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in Aug"
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "HMS Networks AB",
    "title": "Interim report 2024, January – September",
    "description": "Third quarter     Order intake for the third quarter increased by 37% to SEK 677 m (492). Organically, order intake decreased by 8% and currency......",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965332/0/en/Interim-report-2024-January-September.html",
    "urlToImage": "https://ml-eu.globenewswire.com/Resource/Download/c0d357df-b775-43b4-9711-2db8348c7128",
    "publishedAt": "2024-10-18T05:30:00Z",
    "content": "Third quarter \r\n<ul><li>Order intake for the third quarter increased by 37% to SEK 677 m (492). Organically, order intake decreased by 8% and currency translations affected by -4%</li><li>Net sales i… [+8740 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Interim report 2024, January  September Third quarter Order intake for the third quarter increased by 37 to SEK 677 m 492. Organically, order intake decreased by 8 and currency...... Third quarter Order intake for the third quarter increased by 37 to SEK 677 m 492. Organically, order intake decreased by 8 and currency translations affected by -4Net sales i"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "PTI",
    "title": "Rupee slips 1 paisa to 84.07 against US dollar in early trade",
    "description": "The rupee dropped 1 paisa to 84.07 against the US dollar amid negative domestic equity markets and higher crude oil prices. Weakening of the American currency and the continual outflow of foreign funds contributed to the decline. Sensex fell by 372.10 points …",
    "url": "https://economictimes.indiatimes.com/markets/forex/rupee-slips-1-paisa-to-84-07-against-us-dollar-in-early-trade/articleshow/114338233.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114338254,width-1200,height-630,imgsize-2130075,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T05:32:28Z",
    "content": "(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2024 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets… [+317 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Rupee slips 1 paisa to 84.07 against US dollar in early trade The rupee dropped 1 paisa to 84.07 against the US dollar amid negative domestic equity markets and higher crude oil prices. Weakening of the American currency and the continual outflow of foreign funds contributed to the decline. Sensex fell by 372.10 points Whats moving Sensex and Nifty Track latest market news, stock tips, Budget 2024 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Yoshiaki Nohara and Keiko Ujikane",
    "title": "Japan’s Inflation Slows for First Time Since April Ahead of BOJ",
    "description": "(Bloomberg) -- Japan’s key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the ...",
    "url": "https://finance.yahoo.com/news/japan-inflation-slows-first-time-234833173.html",
    "urlToImage": "https://media.zenfs.com/en/bloomberg_markets_842/f5d1ab03f56411d8b64950fd0ed7c381",
    "publishedAt": "2024-10-18T00:51:05Z",
    "content": "(Bloomberg) -- Japans key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the board is widely expected to keep the intere… [+4158 chars]",
    "categories": [
      "Monetary Policy",
      "Economic Indicators"
    ],
    "full_description": "Japans Inflation Slows for First Time Since April Ahead of BOJ Bloomberg -- Japans key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the ... Bloomberg -- Japans key inflation gauge slowed in September for the first time in five months, ahead of a central bank meeting later this month where the board is widely expected to keep the intere"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "editorial-team@simplywallst.com (Simply Wall St)",
    "title": "Exploring 3 High Growth Tech Stocks in Japan",
    "description": "Japan's stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45% and the broader TOPIX Index up 0.45%, supported by yen...",
    "url": "https://finance.yahoo.com/news/exploring-3-high-growth-tech-050630301.html",
    "urlToImage": "https://media.zenfs.com/en/simply_wall_st__316/fbcb1fb47846c704491b7cdca16e4528",
    "publishedAt": "2024-10-18T05:06:30Z",
    "content": "Japan's stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45% and the broader TOPIX Index up 0.45%, supported by yen weakness that has improved profit outlooks … [+5977 chars]",
    "categories": [
      "Currency Specific",
      "Market Sentiment"
    ],
    "full_description": "Exploring 3 High Growth Tech Stocks in Japan Japans stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45 and the broader TOPIX Index up 0.45, supported by yen... Japans stock markets have shown positive momentum recently, with the Nikkei 225 Index gaining 2.45 and the broader TOPIX Index up 0.45, supported by yen weakness that has improved profit outlooks"
  },
  {
    "source": {
      "id": null,
      "name": "Bitcoinist"
    },
    "author": "Samuel Edyme",
    "title": "Ireland To Draft Urgent Crypto Laws Ahead Of EU’s Crackdown On Money Laundering",
    "description": "Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Union’s upcoming Anti-Money Laundering (AML) and counter-terrorism financing (CTF) standards. Finance Minister Jack Chambers announced to the cabinet…",
    "url": "https://bitcoinist.com/ireland-to-draft-urgent-crypto-laws-of-eu-crackdown/",
    "urlToImage": "https://bitcoinist.com/wp-content/uploads/2024/10/DALL·E-2024-10-17-15.42.37-A-digital-illustration-depicting-Ireland-drafting-urgent-crypto-laws-ahead-of-the-EUs-crackdown-on-money-laundering.-The-image-features-symbols-of-cr.webp",
    "publishedAt": "2024-10-18T07:00:40Z",
    "content": "Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Unions upcoming Anti-Money Laundering (AML) and counter-terrorism financing (CTF) standar… [+3165 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Ireland To Draft Urgent Crypto Laws Ahead Of EUs Crackdown On Money Laundering Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Unions upcoming Anti-Money Laundering AML and counter-terrorism financing CTF standards. Finance Minister Jack Chambers announced to the cabinet Ireland appears to be taking swift action to implement new crypto regulations in anticipation of the European Unions upcoming Anti-Money Laundering AML and counter-terrorism financing CTF standar"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ETMarkets.com",
    "title": "Stock to Watch: Wipro shares in focus after co posts 21% YoY jump in Q2 PAT",
    "description": "Wipro Share Price: Wipro reports a 21% rise in net profit to Rs 3,209 crore for Q2 FY2024, surpassing estimates. Revenue from operations stood at Rs 22,302 crore, slightly down from last year. Outlook for Q3 anticipates IT Services revenue between $2,607 mill…",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-wipro-shares-in-focus-after-co-posts-21-yoy-jump-in-q2-pat/articleshow/114333641.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114333623,width-1200,height-630,imgsize-28732,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T03:07:45Z",
    "content": "Shares of Wipro will be in focus on Friday following IT major's July-September quarter earnings where the company reported a 21% jump in net profit to Rs 3,209 crore for the quarter ended September 2… [+2008 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Stock to Watch Wipro shares in focus after co posts 21 YoY jump in Q2 PAT Wipro Share Price Wipro reports a 21 rise in net profit to Rs 3,209 crore for Q2 FY2024, surpassing estimates. Revenue from operations stood at Rs 22,302 crore, slightly down from last year. Outlook for Q3 anticipates IT Services revenue between 2,607 mill Shares of Wipro will be in focus on Friday following IT majors July-September quarter earnings where the company reported a 21 jump in net profit to Rs 3,209 crore for the quarter ended September 2"
  },
  {
    "source": {
      "id": null,
      "name": "Coinjournal.net"
    },
    "author": "Benson Toti",
    "title": "Worldcoin rebrands, launches World Chain mainnet",
    "description": "Worldcoin has rebranded to ‘World’ and introduced several new features to enhance its World ID. The project also announced the mainnet launch of its blockchain World Chain. Worldcoin is now simply “World” after the blockchain-based identity verification proje…",
    "url": "https://coinjournal.net/news/worldcoin-rebrands-launches-world-chain-mainnet/",
    "urlToImage": "https://coinjournal.net/wp-content/uploads/2024/04/Sam-Altmans-Worldcoin-eyes-PayPal-and-OpenAI-partnerships.jpg",
    "publishedAt": "2024-10-18T08:18:23Z",
    "content": "Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates and/or business partners of this site and/or its owners, op… [+2173 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Worldcoin rebrands, launches World Chain mainnet Worldcoin has rebranded to World and introduced several new features to enhance its World ID. The project also announced the mainnet launch of its blockchain World Chain. Worldcoin is now simply World after the blockchain-based identity verification proje Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates andor business partners of this site andor its owners, op"
  },
  {
    "source": {
      "id": null,
      "name": "Coinjournal.net"
    },
    "author": "Benson Toti",
    "title": "Dogecoin (DOGE) price up as meme coins rise",
    "description": "Dogecoin price spiked double-digits in 24 hours to hit its highest level in close to three months. DOGE price broke above $0.13, above levels seen in July as several meme coins surged. While the meme coin’s price rose amid broader optimism in the crypto marke…",
    "url": "https://coinjournal.net/news/dogecoin-doge-price-up-as-meme-coins-rise/",
    "urlToImage": "https://coinjournal.net/wp-content/uploads/2024/01/1690227506184-e1cf39bf-4928-4da1-922f-475ddf635a1c.jpg",
    "publishedAt": "2024-10-18T10:52:44Z",
    "content": "Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates and/or business partners of this site and/or its owners, op… [+2173 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Dogecoin DOGE price up as meme coins rise Dogecoin price spiked double-digits in 24 hours to hit its highest level in close to three months. DOGE price broke above 0.13, above levels seen in July as several meme coins surged. While the meme coins price rose amid broader optimism in the crypto marke Please be aware that some of the links on this site will direct you to the websites of third parties, some of whom are marketing affiliates andor business partners of this site andor its owners, op"
  },
  {
    "source": {
      "id": null,
      "name": "Globalsecurity.org"
    },
    "author": "John Pike",
    "title": "Life sentence for Vietnamese tycoon already facing death penalty",
    "description": "Businesswoman Truong My Lan was sentenced to life in prison on Thursday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported.",
    "url": "https://www.globalsecurity.org/military/library/news/2024/10/mil-241017-rfa02.htm",
    "urlToImage": null,
    "publishedAt": "2024-10-18T07:04:17Z",
    "content": "Truong My Lan was found guilty of swindling tens of thousands of investors in the country's biggest fraud case.\r\nBy Mike Firn for RFA 2024.10.17 -- Businesswoman Truong My Lan was sentenced to life i… [+2278 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Life sentence for Vietnamese tycoon already facing death penalty Businesswoman Truong My Lan was sentenced to life in prison on Thursday in relation to a multi-billion-dollar fraud for which she already faces the death penalty, Vietnamese media reported. Truong My Lan was found guilty of swindling tens of thousands of investors in the countrys biggest fraud case. By Mike Firn for RFA 2024.10.17 -- Businesswoman Truong My Lan was sentenced to life i"
  },
  {
    "source": {
      "id": null,
      "name": "CounterPunch"
    },
    "author": "Roger Harris",
    "title": "Cuba Under Intensified US Sanctions Confronts Its Greatest Challenge: the Continuity of Obama-Trump-Biden Policy",
    "description": "“The majority of Cubans support Castro…every possible means should be undertaken promptly to weaken the economic life of Cuba…to decrease monetary and real wages, to bring about hunger, desperation and overthrow of government.” – Lester D. Mallory, US Deputy …",
    "url": "https://www.counterpunch.org/?p=338342",
    "urlToImage": "https://www.counterpunch.org/wp-content/uploads/2021/06/cp-default-share.png",
    "publishedAt": "2024-10-18T05:55:15Z",
    "content": "The majority of Cubans support Castroevery possible means should be undertaken promptly to weaken the economic life of Cubato decrease monetary and real wages, to bring about hunger, desperation and … [+9615 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Cuba Under Intensified US Sanctions Confronts Its Greatest Challenge the Continuity of Obama-Trump-Biden Policy The majority of Cubans support Castroevery possible means should be undertaken promptly to weaken the economic life of Cubato decrease monetary and real wages, to bring about hunger, desperation and overthrow of government.  Lester D. Mallory, US Deputy The majority of Cubans support Castroevery possible means should be undertaken promptly to weaken the economic life of Cubato decrease monetary and real wages, to bring about hunger, desperation and"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ET Bureau",
    "title": "Infosys net profit rises 4.7% in Q2, misses Street estimates",
    "description": "The guidance change is the sixth consecutive quarterly revision and seventh in eight quarters. Infosys is seeing a “lot of traction in financial services, which has given us good growth last quarter and this quarter,” said chief executive officer Salil Parekh…",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-net-profit-rises-4-7-in-q2-misses-street-estimates/articleshow/114331924.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114331920,width-1200,height-630,imgsize-47896,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T00:49:59Z",
    "content": "Bengaluru : Infosys, Indias second-largest IT company, posted a 4.7% increase in September quarter net profit to 6,506 crore, slightly below market estimates, from the year earlier.Some deal ramp-ups… [+3710 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Infosys net profit rises 4.7 in Q2, misses Street estimates The guidance change is the sixth consecutive quarterly revision and seventh in eight quarters. Infosys is seeing a lot of traction in financial services, which has given us good growth last quarter and this quarter, said chief executive officer Salil Parekh Bengaluru  Infosys, Indias second-largest IT company, posted a 4.7 increase in September quarter net profit to 6,506 crore, slightly below market estimates, from the year earlier.Some deal ramp-ups"
  },
  {
    "source": {
      "id": null,
      "name": "newsBTC"
    },
    "author": "Christian Encila",
    "title": "Analysts On Bitcoin: 2024 US Election Could Steer The Crypto’s Future",
    "description": "Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will take their toll on the cryptocurrency in the near future with…",
    "url": "http://www.newsbtc.com/news/qcp-capital-on-bitcoin-2024-us-election-could-steer-the-cryptos-future/",
    "urlToImage": "https://www.newsbtc.com/wp-content/uploads/2024/10/A_ef5b98.png?fit=2048%2C1152",
    "publishedAt": "2024-10-18T07:00:10Z",
    "content": "Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will t… [+3138 chars]",
    "categories": [
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Analysts On Bitcoin 2024 US Election Could Steer The Cryptos Future Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will take their toll on the cryptocurrency in the near future with Yet another reason that has given the rocket fuel to the price of Bitcoin is the rapidly approaching US presidential elections. Several analysts are keenly observing whether political dynamics will t"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo Entertainment"
    },
    "author": "Erica Yokoyama",
    "title": "Japan Union to Call for Continued Wage Growth of 5% or More",
    "description": "(Bloomberg) -- Japan’s largest labor union federation aims to secure wage increases averaging at least 5% in next year’s pay negotiations, in a bid to...",
    "url": "https://www.yahoo.com/news/japan-union-call-continued-wage-061457986.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/CjrPjZ_zGdTGws2Jqc2qqA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02ODc-/https://media.zenfs.com/en/bloomberg_politics_602/1c3e33e2d40f531d9c56af9e100483cd",
    "publishedAt": "2024-10-18T06:14:57Z",
    "content": "(Bloomberg) -- Japans largest labor union federation aims to secure wage increases averaging at least 5% in next years pay negotiations, in a bid to maintain momentum after major gains this year, acc… [+5102 chars]",
    "categories": [
      "Monetary Policy",
      "Market Sentiment"
    ],
    "full_description": "Japan Union to Call for Continued Wage Growth of 5 or More Bloomberg -- Japans largest labor union federation aims to secure wage increases averaging at least 5 in next years pay negotiations, in a bid to... Bloomberg -- Japans largest labor union federation aims to secure wage increases averaging at least 5 in next years pay negotiations, in a bid to maintain momentum after major gains this year, acc"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Dollar buoyant, equities cautious ahead of China data",
    "description": "Dollar buoyant, equities cautious ahead of China data",
    "url": "https://www.investing.com/news/stock-market-news/dollar-buoyant-equities-cautious-ahead-of-china-data-3670054",
    "urlToImage": "https://i-invdn-com.investing.com/news/LYNXNPEBAG0BO_L.jpg",
    "publishedAt": "2024-10-18T01:40:36Z",
    "content": "By Kevin Buckland\r\nTOKYO (Reuters) - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing… [+3330 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Dollar buoyant, equities cautious ahead of China data By Kevin Buckland TOKYO Reuters - The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Investing.com",
    "title": "Asia FX muted as dollar steadies at over 2-mth peaks on strong data",
    "description": "Asia FX muted as dollar steadies at over 2-mth peaks on strong data",
    "url": "https://www.investing.com/news/forex-news/asia-fx-muted-as-dollar-steadies-at-over-2mth-peaks-on-strong-data-3670093",
    "urlToImage": "https://i-invdn-com.investing.com/news/moved_LYNXMPEI7N017_L.jpg",
    "publishedAt": "2024-10-18T04:16:17Z",
    "content": "Investing.com-- Most Asian currencies kept to a tight range on Friday as the dollar steadied at more than two-month highs as strong economic data furthered expectations of smaller interest rate cuts.… [+2624 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Asia FX muted as dollar steadies at over 2-mth peaks on strong data Investing.com-- Most Asian currencies kept to a tight range on Friday as the dollar steadied at more than two-month highs as strong economic data furthered expectations of smaller interest rate cuts."
  },
  {
    "source": {
      "id": null,
      "name": "Rappler"
    },
    "author": "Mon Abrea",
    "title": "[Ask The Tax Whiz] Accounting and tax treatment for Foreign Currency Transactions",
    "description": "The Philippine Tax Whiz explains the recently issued RMC 12-2024 which aims to clarify the foreign exchange transactions for Financial Reporting and Internal Revenue Tax Purposes",
    "url": "https://www.rappler.com/business/ask-the-tax-whiz-accounting-treatment-foreign-currency-transactions/",
    "urlToImage": "https://www.rappler.com/tachyon/2022/11/tax-papers-hand-shutterstock.jpg",
    "publishedAt": "2024-10-18T05:57:13Z",
    "content": "Foreign currency transactions are converted into functional currency³ using the spot rate at the transaction time, with taxpayers consistently applying their chosen rate (e.g. open, close, high, low,… [+1982 chars]",
    "categories": [
      "Economic Indicators",
      "Currency Specific"
    ],
    "full_description": "Ask The Tax Whiz Accounting and tax treatment for Foreign Currency Transactions The Philippine Tax Whiz explains the recently issued RMC 12-2024 which aims to clarify the foreign exchange transactions for Financial Reporting and Internal Revenue Tax Purposes Foreign currency transactions are converted into functional currency³ using the spot rate at the transaction time, with taxpayers consistently applying their chosen rate e.g. open, close, high, low,"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Investing.com",
    "title": "Infosys stock under pressure, Investec lowers target citing weak growth outlook",
    "description": "Infosys stock under pressure, Investec lowers target citing weak growth outlook",
    "url": "https://www.investing.com/news/company-news/infosys-stock-under-pressure-investec-lowers-target-citing-weak-growth-outlook-93CH-3670300",
    "urlToImage": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
    "publishedAt": "2024-10-18T08:54:28Z",
    "content": "On Friday, Investec maintained its Sell rating on Infosys (NS:INFY) Ltd. (INFO:IN) (NYSE: INFY) stock but lowered the price target to INR1,700.00 from INR1,720.00. The adjustment follows Infosys' fir… [+1554 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Infosys stock under pressure, Investec lowers target citing weak growth outlook On Friday, Investec maintained its Sell rating on Infosys NSINFY Ltd. INFOIN NYSE INFY stock but lowered the price target to INR1,700.00 from INR1,720.00. The adjustment follows Infosys fir"
  },
  {
    "source": {
      "id": null,
      "name": "CryptoGlobe"
    },
    "author": "CryptoGlobe Writer",
    "title": "PayPal’s PYUSD Market Cap Plummets by $400 Billion Amid Yield Declines",
    "description": "PayPal’s stablecoin, PYUSD, has experienced a dramatic decline in market capitalization over the past six weeks, going from over $1 billion to around $610 billion at the time of writing. Once a top four stablecoin, PYUSD’s value has plummeted from its August …",
    "url": "https://www.cryptoglobe.com/latest/2024/10/paypals-pyusd-market-cap-plummets-by-400-billion-amid-yield-declines/",
    "urlToImage": "https://media.cryptoglobe.com/2021/12/josh-appel-NeTPASr-bmQ-unsplash-768x577.jpg",
    "publishedAt": "2024-10-18T04:13:00Z",
    "content": "PayPals stablecoin, PYUSD, has experienced a dramatic decline in market capitalization over the past six weeks, going from over $1 billion to around $610 billion at the time of writing.\r\nOnce a top f… [+1783 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "PayPals PYUSD Market Cap Plummets by 400 Billion Amid Yield Declines PayPals stablecoin, PYUSD, has experienced a dramatic decline in market capitalization over the past six weeks, going from over 1 billion to around 610 billion at the time of writing. Once a top four stablecoin, PYUSDs value has plummeted from its August PayPals stablecoin, PYUSD, has experienced a dramatic decline in market capitalization over the past six weeks, going from over 1 billion to around 610 billion at the time of writing. Once a top f"
  },
  {
    "source": {
      "id": null,
      "name": "Digital Journal"
    },
    "author": "AFP",
    "title": "Japan’s core inflation rate slows in September",
    "description": "Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in August as the pace of increase in electricity and gas prices rel…",
    "url": "https://www.digitaljournal.com/world/japans-core-inflation-rate-slows-in-september/article",
    "urlToImage": "https://www.digitaljournal.com/wp-content/uploads/2024/10/3f76fcc4f71618ec5301bb9843b80d863315deff.jpg",
    "publishedAt": "2024-10-18T00:22:33Z",
    "content": "Japanese inflation has been above the central bank's two percent target since April 2022 - Copyright AFP Philip FONG\r\nJapanese inflation slowed in September with prices up 2.4 percent on-year, not in… [+1881 chars]",
    "categories": [
      "Monetary Policy",
      "Economic Indicators"
    ],
    "full_description": "Japans core inflation rate slows in September Japanese inflation slowed in September with prices up 2.4 percent on-year, not including volatile fresh food, official data showed Friday. The core Consumer Price Index eased from 2.8 percent in August as the pace of increase in electricity and gas prices rel Japanese inflation has been above the central banks two percent target since April 2022 - Copyright AFP Philip FONG Japanese inflation slowed in September with prices up 2.4 percent on-year, not in"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ETMarkets.com",
    "title": "Pre-market action: Here's the trade setup for today's session",
    "description": "The RSI is showing a bearish crossover and is declining. However, this may not be the ideal level to initiate short positions, as the index has experienced a steep correction and is near a double-bottom support, which could trigger a near-term recovery toward…",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/114332009.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114332004,width-1200,height-630,imgsize-80439,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T01:06:18Z",
    "content": "Domestic markets experienced a decline for the third consecutive session amidst a broad-based selling. Rising domestic inflation data released this week and continued FII selling weighed on the marke… [+1833 chars]",
    "categories": [
      "Economic Indicators",
      "Market Sentiment",
      "Geopolitical"
    ],
    "full_description": "Pre-market action Heres the trade setup for todays session The RSI is showing a bearish crossover and is declining. However, this may not be the ideal level to initiate short positions, as the index has experienced a steep correction and is near a double-bottom support, which could trigger a near-term recovery toward Domestic markets experienced a decline for the third consecutive session amidst a broad-based selling. Rising domestic inflation data released this week and continued FII selling weighed on the marke"
  },
  {
    "source": {
      "id": null,
      "name": "Tistory.com"
    },
    "author": "T.B",
    "title": "김건희 게이트(2024 Election, War and Rich) 215",
    "description": "Harris calls out Trump for ‘gaslighting’ Americans about Jan. 6 attack https://t.co/kkklUYz5pK— Post Politics (@postpolitics) October 18, 2024 Musk stumps for Trump in Pennsylvania https://t.co/A30KgI6uJt— POLITICO (@politico) October 18, 2024 S 전자(반도체부문).. 왜…",
    "url": "https://ryueyes11.tistory.com/511109",
    "urlToImage": "https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FbpScYF%2FbtsKbFDO8d2%2FcjWz7vtjwqeplAX6sDhy80%2Fimg.jpg",
    "publishedAt": "2024-10-18T06:11:17Z",
    "content": "Harris calls out Trump for ‘gaslighting’ Americans about Jan. 6 attack https://t.co/kkklUYz5pK\r\n— Post Politics (@postpolitics) October 18, 2024\r\nMusk stumps for Trump in Pennsylvania https://t.co/A3… [+8659 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "김건희 게이트2024 Election, War and Rich 215 Harris calls out Trump for gaslighting Americans about Jan. 6 attack httpst.cokkklUYz5pK Post Politics postpolitics October 18, 2024 Musk stumps for Trump in Pennsylvania httpst.coA30KgI6uJt POLITICO politico October 18, 2024 S 전자반도체부문.. 왜 Harris calls out Trump for gaslighting Americans about Jan. 6 attack httpst.cokkklUYz5pK  Post Politics postpolitics October 18, 2024 Musk stumps for Trump in Pennsylvania httpst.coA3"
  },
  {
    "source": {
      "id": null,
      "name": "Digital Journal"
    },
    "author": "AFP",
    "title": "Nigerians sacrifice cars as cost of living crisis worsens",
    "description": "Nigeria’s economic crisis and soaring petrol prices forced Bolaji Emmanuel to give up his driver and his Honda Pilot utility vehicle, as he struggles with spiking living costs.  Emmanuel is not alone. Many in Africa’s most populous country are abandoning thei…",
    "url": "https://www.digitaljournal.com/world/nigerians-sacrifice-cars-as-cost-of-living-crisis-worsens/article",
    "urlToImage": "https://www.digitaljournal.com/wp-content/uploads/2024/10/7c52fb2bd78e26c48cfd292301232fa53b37cd45.jpg",
    "publishedAt": "2024-10-18T05:22:34Z",
    "content": "Nigeria has seen one of its worst crises in decades with hiking fuel prices and inflation at a three-decade high - Copyright AFP GREG BAKER\r\nNigeria’s economic crisis and soaring petrol prices forced… [+3998 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Nigerians sacrifice cars as cost of living crisis worsens Nigerias economic crisis and soaring petrol prices forced Bolaji Emmanuel to give up his driver and his Honda Pilot utility vehicle, as he struggles with spiking living costs. Emmanuel is not alone. Many in Africas most populous country are abandoning thei Nigeria has seen one of its worst crises in decades with hiking fuel prices and inflation at a three-decade high - Copyright AFP GREG BAKER Nigerias economic crisis and soaring petrol prices forced"
  },
  {
    "source": {
      "id": null,
      "name": "Ambcrypto.com"
    },
    "author": "AMBCrypto Team",
    "title": "India overtakes traditional hubs to lead global crypto adoption",
    "description": "India leads global crypto adoption, outpacing traditional hubs, despite regulatory challenges, marking a major shift in Asia's crypto landscape.",
    "url": "https://ambcrypto.com/india-overtakes-traditional-hubs-to-lead-global-crypto-adoption/",
    "urlToImage": "https://ambcrypto.com/wp-content/uploads/2024/10/India-crypto-1000x600.png",
    "publishedAt": "2024-10-18T09:30:53Z",
    "content": "<ul><li>India became the global leader in cryptocurrency adoption, surpassing traditional hubs, despite its challenging regulatory environment.</li><li>This development reflected a growing trend in A… [+2659 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "India overtakes traditional hubs to lead global crypto adoption India leads global crypto adoption, outpacing traditional hubs, despite regulatory challenges, marking a major shift in Asias crypto landscape. India became the global leader in cryptocurrency adoption, surpassing traditional hubs, despite its challenging regulatory environment.This development reflected a growing trend in A"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Morning Bid: Lots of China news, little clarity",
    "description": "Morning Bid: Lots of China news, little clarity",
    "url": "https://www.investing.com/news/economy-news/morning-bid-lots-of-china-news-little-clarity-3670095",
    "urlToImage": "https://i-invdn-com.investing.com/news/indicatornews_1_800x533_L_1413124982.jpg",
    "publishedAt": "2024-10-18T04:36:14Z",
    "content": "By Kevin Buckland\r\nA look at the day ahead in European and global markets from Kevin Buckland\r\nChina is very much the center of attention today, following a barrage of data and remarks from its centr… [+1912 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Morning Bid Lots of China news, little clarity By Kevin Buckland A look at the day ahead in European and global markets from Kevin Buckland China is very much the center of attention today, following a barrage of data and remarks from its centr"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ETtech",
    "title": "Wipro’s Q2 net profit rises 6.3% QoQ to Rs 3,227 crore",
    "description": "The fourth largest Indian IT services firm posted a net profit of Rs 3,227 crore for the quarter ended September 30. Revenue rose 1.5% sequentially to Rs 22,301 crore, helped by increased momentum in banking, financial services and insurance (BFSI) and consul…",
    "url": "https://economictimes.indiatimes.com/tech/information-tech/wipros-q2-net-profit-rises-6-3-qoq-to-rs-3227-crore/articleshow/114326545.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114326533,width-1200,height-630,imgsize-47250,overlay-ettech/articleshow.jpg",
    "publishedAt": "2024-10-18T00:30:00Z",
    "content": "Wipro on Thursday posted a 21% year-on-year and 6.3% sequential increase in net profit for the second quarter, when three of its four strategic market units (SMUs) reported better performance and the… [+2313 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Wipros Q2 net profit rises 6.3 QoQ to Rs 3,227 crore The fourth largest Indian IT services firm posted a net profit of Rs 3,227 crore for the quarter ended September 30. Revenue rose 1.5 sequentially to Rs 22,301 crore, helped by increased momentum in banking, financial services and insurance BFSI and consul Wipro on Thursday posted a 21 year-on-year and 6.3 sequential increase in net profit for the second quarter, when three of its four strategic market units SMUs reported better performance and the"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "Bloomberg",
    "title": "Supercharging one key market is key to India’s $5 trillion goals",
    "description": "Infrastructure investments: India's quest to double its 47 trillion rupee corporate bond market, essential for reaching a $5 trillion economy, faces hurdles due to strict investment regulations. Despite recent reforms to boost liquidity and attract retail inv…",
    "url": "https://economictimes.indiatimes.com/news/economy/infrastructure/infrastructure-investments-infrastructure-bonds-supercharging-a-market-is-key-to-indias-5-lakh-crore-goals/articleshow/114343476.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114343519,width-1200,height-630,imgsize-421194,overlay-economictimes/articleshow.jpg",
    "publishedAt": "2024-10-18T08:02:23Z",
    "content": "India, already the worlds fastest-growing major economy, is pushing for even more dramatic expansion to become a developed nation, a goal that hinges on expanding access to capital.Nothing illustrate… [+5747 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Supercharging one key market is key to Indias 5 trillion goals Infrastructure investments Indias quest to double its 47 trillion rupee corporate bond market, essential for reaching a 5 trillion economy, faces hurdles due to strict investment regulations. Despite recent reforms to boost liquidity and attract retail inv India, already the worlds fastest-growing major economy, is pushing for even more dramatic expansion to become a developed nation, a goal that hinges on expanding access to capital.Nothing illustrate"
  },
  {
    "source": {
      "id": null,
      "name": "Investing.com"
    },
    "author": "Investing.com",
    "title": "BofA cuts WNS stock target, maintains Buy rating",
    "description": "BofA cuts WNS stock target, maintains Buy rating",
    "url": "https://www.investing.com/news/company-news/bofa-cuts-wns-stock-target-maintains-buy-rating-93CH-3670663",
    "urlToImage": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
    "publishedAt": "2024-10-18T11:01:05Z",
    "content": "BofA Securities has adjusted its outlook on WNS Limited (NYSE: NYSE:WNS), reducing the price target to $57 from the previous $66, while keeping a Buy rating on the shares. \r\nThe reassessment came aft… [+3368 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "BofA cuts WNS stock target, maintains Buy rating BofA Securities has adjusted its outlook on WNS Limited NYSE NYSEWNS, reducing the price target to 57 from the previous 66, while keeping a Buy rating on the shares. The reassessment came aft"
  },
  {
    "source": {
      "id": null,
      "name": "Digital Journal"
    },
    "author": "AFP",
    "title": "Asian markets swing as China economic growth slows",
    "description": "Asian markets fluctuated Friday after China posted its weakest economic growth in a year and a half, as gold prices hit a record high and following a tepid lead from Wall Street. Investors have been clamouring for Beijing to deliver more concrete plans for th…",
    "url": "https://www.digitaljournal.com/world/asian-markets-swing-as-china-economic-growth-slows/article",
    "urlToImage": "https://www.digitaljournal.com/wp-content/uploads/2024/10/332cbc24d2f88e88d4011627ca6a3a4bedf6775e.jpg",
    "publishedAt": "2024-10-18T03:17:32Z",
    "content": "While the Chinese economy grew at its slowest pace since early 2023, data also showed a pick-up in retail sales - Copyright AFP GREG BAKER\r\nAsian markets fluctuated Friday after China posted its weak… [+3042 chars]",
    "categories": [
      "Economic Indicators"
    ],
    "full_description": "Asian markets swing as China economic growth slows Asian markets fluctuated Friday after China posted its weakest economic growth in a year and a half, as gold prices hit a record high and following a tepid lead from Wall Street. Investors have been clamouring for Beijing to deliver more concrete plans for th While the Chinese economy grew at its slowest pace since early 2023, data also showed a pick-up in retail sales - Copyright AFP GREG BAKER Asian markets fluctuated Friday after China posted its weak"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "ETtech",
    "title": "Infosys net profit rises 4.7% in Q2, misses Street estimates",
    "description": "Infosys is seeing a “lot of traction in financial services, which has given us good growth last quarter and this quarter,” said chief executive officer Salil Parekh. “We see that continuing.”",
    "url": "https://economictimes.indiatimes.com/tech/information-tech/infosys-net-profit-rises-4-7-in-q2-misses-street-estimates/articleshow/114326215.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114326225,width-1200,height-630,imgsize-66080,overlay-ettech/articleshow.jpg",
    "publishedAt": "2024-10-18T00:30:00Z",
    "content": "Infosys, Indias second-largest IT company, posted a 4.7% increase in September quarter net profit to Rs 6,506 crore, slightly below market estimates, from the year earlier. Some deal ramp-ups and an … [+4441 chars]",
    "categories": [
      "Geopolitical"
    ],
    "full_description": "Infosys net profit rises 4.7 in Q2, misses Street estimates Infosys is seeing a lot of traction in financial services, which has given us good growth last quarter and this quarter, said chief executive officer Salil Parekh. We see that continuing. Infosys, Indias second-largest IT company, posted a 4.7 increase in September quarter net profit to Rs 6,506 crore, slightly below market estimates, from the year earlier. Some deal ramp-ups and an"
  },
  {
    "source": {
      "id": null,
      "name": "Finextra"
    },
    "author": "Editorial Team",
    "title": "Axiom Bank hit with enforcement action",
    "description": "The Office of the Comptroller of the Currency (OCC) has filed an enforcement action against Axiom Bank in Florida.",
    "url": "https://www.finextra.com/newsarticle/44896/axiom-bank-hit-with-enforcement-action",
    "urlToImage": "https://www.finextra.com/finextra-images/top_pics/xl/at-which-stage-is-money-laundering-easy-to-detect.jpg",
    "publishedAt": "2024-10-18T10:31:01Z",
    "content": "The Office of the Comptroller of the Currency (OCC) has filed an enforcement action against Axiom Bank in Florida.The action was filed due to suspicious activity, insufficient compliance with Bank Se… [+531 chars]",
    "categories": [
      "Currency Specific"
    ],
    "full_description": "Axiom Bank hit with enforcement action The Office of the Comptroller of the Currency OCC has filed an enforcement action against Axiom Bank in Florida. The Office of the Comptroller of the Currency OCC has filed an enforcement action against Axiom Bank in Florida.The action was filed due to suspicious activity, insufficient compliance with Bank Se"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "Kshitij Anand",
    "title": "ETMarkets Smart Talk | Physical vs. Digital Gold: Rajesh Cheruvu’s advice for HNIs this Dhanteras",
    "description": "As we look towards the next Diwali, the outlook for Indian markets remains largely positive, despite recent volatility sparked by geopolitical tensions. Sensex and Nifty have hit fresh highs this year, supported by robust domestic institutional investments an…",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-physical-vs-digital-gold-rajesh-cheruvus-advice-for-hnis-this-dhanteras/articleshow/114307077.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114307135,width-1200,height-630,imgsize-19984,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T03:30:00Z",
    "content": "Digital gold, on the other hand, offers a more modern and convenient approach. It allows for seamless online transactions without the need for physical storage or security concerns, says Rajesh Cheru… [+11423 chars]",
    "categories": [
      "Market Sentiment",
      "Geopolitical"
    ],
    "full_description": "ETMarkets Smart Talk  Physical vs. Digital Gold Rajesh Cheruvus advice for HNIs this Dhanteras As we look towards the next Diwali, the outlook for Indian markets remains largely positive, despite recent volatility sparked by geopolitical tensions. Sensex and Nifty have hit fresh highs this year, supported by robust domestic institutional investments an Digital gold, on the other hand, offers a more modern and convenient approach. It allows for seamless online transactions without the need for physical storage or security concerns, says Rajesh Cheru"
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "Research and Markets",
    "title": "Turkey Insurance Industry Governance, Risk and Compliance Report 2024",
    "description": "Dublin, Oct. 18, 2024 (GLOBE NEWSWIRE) -- The \"Turkey Insurance Industry - Governance, Risk and Compliance\" report has been added to ResearchAndMarkets.com's offering.",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965422/28124/en/Turkey-Insurance-Industry-Governance-Risk-and-Compliance-Report-2024.html",
    "urlToImage": "https://ml.globenewswire.com/Resource/Download/908fb457-7f8e-4a08-9081-5565e3dfb3d7",
    "publishedAt": "2024-10-18T09:59:00Z",
    "content": "Dublin, Oct. 18, 2024 (GLOBE NEWSWIRE) -- The \"Turkey Insurance Industry - Governance, Risk and Compliance\" report has been added to ResearchAndMarkets.com's offering.\r\nThe report provides detailed a… [+11508 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Turkey Insurance Industry Governance, Risk and Compliance Report 2024 Dublin, Oct. 18, 2024 GLOBE NEWSWIRE -- The Turkey Insurance Industry - Governance, Risk and Compliance report has been added to ResearchAndMarkets.coms offering. Dublin, Oct. 18, 2024 GLOBE NEWSWIRE -- The Turkey Insurance Industry - Governance, Risk and Compliance report has been added to ResearchAndMarkets.coms offering. The report provides detailed a"
  },
  {
    "source": {
      "id": null,
      "name": "BusinessLine"
    },
    "author": "Team BL",
    "title": "Wipro Share Price Highlights October 18, 2024: Wipro shares rally as Q2 results beat estimates",
    "description": "Wipro Stocks, Wipro Share Price Updates 18 Oct 2024: IT major Wipro has recorded a 21 per cent profit rise, beating market estimates. While revenue and margins reported were largely in line with street estimates in Q2, the outlook for next quarter isn’t encou…",
    "url": "https://www.thehindubusinessline.com/markets/stock-markets/wipro-stocks-wipro-share-price-updates-18-oct-2024/article68767754.ece",
    "urlToImage": "https://bl-i.thgim.com/public/incoming/68vshy/article68767753.ece/alternates/LANDSCAPE_1200/2024-10-17T102320Z_1719727169_RC2P56ASWIGE_RTRMADP_3_WIPRO-LTD-RESULTS.JPG",
    "publishedAt": "2024-10-18T04:28:59Z",
    "content": "<li></li>\r\nOctober 18, 2024 15:40Wipro shares closing figures: Shares end nearly 4% higher\r\nWipro stock closed 3.59% higher on the NSE at 547.75. On the BSE, the stock ended 3.63% higher at 548.\r\n<li… [+5928 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Wipro Share Price Highlights October 18, 2024 Wipro shares rally as Q2 results beat estimates Wipro Stocks, Wipro Share Price Updates 18 Oct 2024 IT major Wipro has recorded a 21 per cent profit rise, beating market estimates. While revenue and margins reported were largely in line with street estimates in Q2, the outlook for next quarter isnt encou October 18, 2024 1540Wipro shares closing figures Shares end nearly 4 higher Wipro stock closed 3.59 higher on the NSE at 547.75. On the BSE, the stock ended 3.63 higher at 548. li"
  },
  {
    "source": {
      "id": "the-times-of-india",
      "name": "The Times of India"
    },
    "author": "Reuters",
    "title": "Dollar buoyant, equities cautious ahead of China data",
    "description": "The dollar remains near an 11-week high against major peers due to strong U.S. economic data and market speculation of a Trump election victory. Asian stocks show mixed performance, with Japan's Nikkei rising. Key Chinese economic data and geopolitical tensio…",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/dollar-buoyant-equities-cautious-ahead-of-china-data/articleshow/114332555.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-114332560,width-1200,height-630,imgsize-133518,overlay-etmarkets/articleshow.jpg",
    "publishedAt": "2024-10-18T02:04:36Z",
    "content": "The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing. Asian stocks were mixed, with Japan… [+3330 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific",
      "Geopolitical"
    ],
    "full_description": "Dollar buoyant, equities cautious ahead of China data The dollar remains near an 11-week high against major peers due to strong U.S. economic data and market speculation of a Trump election victory. Asian stocks show mixed performance, with Japans Nikkei rising. Key Chinese economic data and geopolitical tensio The dollar hovered close to an 11-week high versus major peers on Friday after robust U.S. economic data allowed for a more patient path of Federal Reserve easing. Asian stocks were mixed, with Japan"
  },
  {
    "source": {
      "id": null,
      "name": "ETF Daily News"
    },
    "author": "MarketBeat News",
    "title": "Head to Head Review: Rakuten Group (OTCMKTS:RKUNF) versus MonotaRO (OTCMKTS:MONOY)",
    "description": "Rakuten Group (OTCMKTS:RKUNF – Get Free Report) and MonotaRO (OTCMKTS:MONOY – Get Free Report) are both consumer cyclical companies, but which is the better stock? We will compare the two companies based on the strength of their risk, valuation, dividends, an…",
    "url": "https://www.etfdailynews.com/2024/10/18/head-to-head-review-rakuten-group-otcmktsrkunf-versus-monotaro-otcmktsmonoy/",
    "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/monotaro-co-ltd-logo-1200x675.png?v=20240604123930&w=240&h=240&zc=2",
    "publishedAt": "2024-10-18T05:59:33Z",
    "content": "Rakuten Group (OTCMKTS:RKUNF – Get Free Report) and MonotaRO (OTCMKTS:MONOY – Get Free Report) are both consumer cyclical companies, but which is the better stock? We will compare the two companies b… [+5659 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Head to Head Review Rakuten Group OTCMKTSRKUNF versus MonotaRO OTCMKTSMONOY Rakuten Group OTCMKTSRKUNF  Get Free Report and MonotaRO OTCMKTSMONOY  Get Free Report are both consumer cyclical companies, but which is the better stock? We will compare the two companies based on the strength of their risk, valuation, dividends, an Rakuten Group OTCMKTSRKUNF  Get Free Report and MonotaRO OTCMKTSMONOY  Get Free Report are both consumer cyclical companies, but which is the better stock? We will compare the two companies b"
  },
  {
    "source": {
      "id": null,
      "name": "seattlepi.com"
    },
    "author": "By ELAINE KURTENBACH, AP Business Writer",
    "title": "Stock market today: Asian shares gain as China releases plan for market support",
    "description": "Asian shares are higher after China's central bank released plans for supporting stock markets through share repurchases. Beijing also reported that the Chinese economy slowed further in the last quarter, which spurred expectations the government will ramp up…",
    "url": "https://www.seattlepi.com/news/world/article/stock-market-today-asian-shares-gain-as-china-19845717.php",
    "urlToImage": "https://s.hdnux.com/photos/01/44/43/55/26360668/3/rawImage.jpg",
    "publishedAt": "2024-10-18T06:09:58Z",
    "content": "Currency traders watch monitors near a screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchan… [+5226 chars]",
    "categories": [
      "Monetary Policy",
      "Currency Specific"
    ],
    "full_description": "Stock market today Asian shares gain as China releases plan for market support Asian shares are higher after Chinas central bank released plans for supporting stock markets through share repurchases. Beijing also reported that the Chinese economy slowed further in the last quarter, which spurred expectations the government will ramp up Currency traders watch monitors near a screen showing the Korea Composite Stock Price Index KOSPI, left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchan"
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "Research and Markets",
    "title": "Hungary Insurance Industry Governance, Risk and Compliance Report 2024",
    "description": "Dublin, Oct. 18, 2024 (GLOBE NEWSWIRE) -- The \"Hungary Insurance Industry - Governance, Risk and Compliance\" report has been added to ResearchAndMarkets.com's offering.The report provides detailed analysis of the insurance regulations for life, property, moto…",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965418/28124/en/Hungary-Insurance-Industry-Governance-Risk-and-Compliance-Report-2024.html",
    "urlToImage": "https://ml.globenewswire.com/Resource/Download/908fb457-7f8e-4a08-9081-5565e3dfb3d7",
    "publishedAt": "2024-10-18T09:58:00Z",
    "content": "Dublin, Oct. 18, 2024 (GLOBE NEWSWIRE) -- The \"Hungary Insurance Industry - Governance, Risk and Compliance\" report has been added to ResearchAndMarkets.com's offering.\r\nThe report provides detailed … [+12052 chars]",
    "categories": [
      "Market Sentiment",
      "Geopolitical"
    ],
    "full_description": "Hungary Insurance Industry Governance, Risk and Compliance Report 2024 Dublin, Oct. 18, 2024 GLOBE NEWSWIRE -- The Hungary Insurance Industry - Governance, Risk and Compliance report has been added to ResearchAndMarkets.coms offering.The report provides detailed analysis of the insurance regulations for life, property, moto Dublin, Oct. 18, 2024 GLOBE NEWSWIRE -- The Hungary Insurance Industry - Governance, Risk and Compliance report has been added to ResearchAndMarkets.coms offering. The report provides detailed"
  },
  {
    "source": {
      "id": null,
      "name": "GlobeNewswire"
    },
    "author": "Research and Markets",
    "title": "Lesotho Insurance Industry Governance, Risk and Compliance Analysis Report 2024",
    "description": "Dublin, Oct. 18, 2024 (GLOBE NEWSWIRE) -- The \"Lesotho Insurance Industry - Governance, Risk and Compliance\" report has been added to ResearchAndMarkets.com's offering.The report is the result of extensive research into the insurance regulatory framework in L…",
    "url": "https://www.globenewswire.com/news-release/2024/10/18/2965434/28124/en/Lesotho-Insurance-Industry-Governance-Risk-and-Compliance-Analysis-Report-2024.html",
    "urlToImage": "https://ml.globenewswire.com/Resource/Download/908fb457-7f8e-4a08-9081-5565e3dfb3d7",
    "publishedAt": "2024-10-18T10:18:00Z",
    "content": "Dublin, Oct. 18, 2024 (GLOBE NEWSWIRE) -- The \"Lesotho Insurance Industry - Governance, Risk and Compliance\" report has been added to ResearchAndMarkets.com's offering.\r\nThe report is the result of e… [+12058 chars]",
    "categories": [
      "Market Sentiment"
    ],
    "full_description": "Lesotho Insurance Industry Governance, Risk and Compliance Analysis Report 2024 Dublin, Oct. 18, 2024 GLOBE NEWSWIRE -- The Lesotho Insurance Industry - Governance, Risk and Compliance report has been added to ResearchAndMarkets.coms offering.The report is the result of extensive research into the insurance regulatory framework in L Dublin, Oct. 18, 2024 GLOBE NEWSWIRE -- The Lesotho Insurance Industry - Governance, Risk and Compliance report has been added to ResearchAndMarkets.coms offering. The report is the result of e"
  }
]